from kivy.app import App
from kivy.lang import Builder
from bidi.algorithm import get_display
import arabic_reshaper 
from arabic_reshaper import reshape
from kivy.core.window import Window
from kivy.properties import StringProperty
from kivy.uix.screenmanager import  Screen , ScreenManager
Window.clearcolor = (0,100/255.0,1,0)
class MainScreen (ScreenManager):
	pass
class Password (Screen):
	arabic_text = StringProperty("")
	def on_pre_enter(self):
	       original_text = "نورتي التطبيق ياحجه "
	       reshaped_text = arabic_reshaper.reshape(original_text)
	       self.arabic_text = get_display(reshaped_text)
	#def onenter(self):
#	       original_text = "الباسورد يا حجوجه"
#	       reshapem_text = arabic_reshaper.reshape(original_text)
#	       self.arabi_text = get_display(reshapem_text)
	def on_enter(self):
	       original_text = "ادخلي برجلك اليمين"
	       reshaped_text = arabic_reshaper.reshape(original_text)
	       self.arabik_text = get_display(reshaped_text)
class Error (Screen):
	def on_pre_enter(self):
		self.ids.button1.text = self.	get_arabic_text("الباسورد غلط يا موكوسه")
		self.ids.button2.text = self.	get_arabic_text("حاولي تاني")
	def get_arabic_text(self, text):
	    reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	    bidi_text = get_display(reshaped_text)  # تطبيق التنسيق
	    return bidi_text
class Story1 (Screen):
	def on_pre_enter(self):
		self.ids.button1.text = self.	get_arabic_text("رعب")
		self.ids.button2.text = self.	get_arabic_text("تلزيق ")
		self.ids.button4.text = self.	get_arabic_text('اكشن')
		self.ids.button3.text = self.	get_arabic_text('خيال علمي')
		self.ids.button5.text = self.	get_arabic_text('الغاز حقيقيه')
		self.ids.button6.text = self.	get_arabic_text('اطفال يا طفله ')
		self.ids.button7.text = self.	get_arabic_text('ارجعي من هنا')
		self.ids.button8.text = self.	get_arabic_text('البيت بيتك ياحجه اختاري الي يعجبك')
		self.ids.button9.text = self.	get_arabic_text('افتحيها لو زعلانين من بعض بس تمام ')
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class horror (Screen):
    def on_pre_enter(self):
    	self.ids.button1.text = self.get_arabic_text("روايه البيت رقم 13  (خيال)")
    	self.ids.button2.text = self.get_arabic_text("روايه الظلال خلف الباب (خيال)")
    	self.ids.button3.text = self.get_arabic_text("روايه بيت الكوابيس (خيال)")
    	self.ids.button4.text = self.get_arabic_text("روايه رعب أميفيل (حقيقيه)")
    	self.ids.button5.text = self.get_arabic_text("روايه  بيت رعب المعادي (حقيقه)")
    	self.ids.button6.text = self.get_arabic_text("روايه ظل المنصوره (حقيقه)")
    	self.ids.button7.text = self.get_arabic_text("ارجعي من هنا")
    	#self.ids.button8.text = self.get_arabic_text("ارجعي من هنا")
    def get_arabic_text(self, text):
        reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
        bidi_text = get_display(reshaped_text)  # تطبيق التنسيق
        return bidi_text
class romantic (Screen):
	def on_pre_enter(self):
		self.ids.button8.text = self.get_arabic_text("روايه حب في زمن الحرب")
		self.ids.button9.text = self.get_arabic_text("روايه اسرار القلب")
		self.ids.button10.text = self.get_arabic_text("روايه حكايه من الزمن الجميل")
		self.ids.button11.text = self.get_arabic_text("روايه ورده في البستان")
		self.ids.button12.text = self.get_arabic_text("روايه اسطوره العشاق")
		self.ids.button13.text = self.get_arabic_text("روايه  القلب المكسور")
		self.ids.button14.text = self.get_arabic_text("ارجعي من هنا")
    	#self.ids.button8.text = self.get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
		reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
		bidi_text = get_display(reshaped_text)  # تطبيق التنسيق
		return bidi_text
class khaial (Screen):
	def on_pre_enter(self):
	   self.ids.button1.text = self.get_arabic_text("روايه عالم المرايا")
	   self.ids.button2.text = self.get_arabic_text("روايه رحله الي المريخ")
	   self.ids.button3.text = self.get_arabic_text("روايه الذكاء الاصطناعي")
	   self.ids.button4.text = self.get_arabic_text("روايه البحث عن الكوكب المثالي")
	   self.ids.button5.text = self.get_arabic_text("روايه الفضائيون في المدينة")
	   self.ids.button6.text = self.get_arabic_text("روايه الذكاء في عالم السحر")
	   self.ids.button7.text = self.get_arabic_text("ارجعي من هنا")
    	#self.ids.button8.text = self.get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
		reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
		bidi_text = get_display(reshaped_text)  # تطبيق التنسيق
		return bidi_text
class action (Screen):
	def on_pre_enter(self):
		self.ids.button1.text = self.get_arabic_text("روايه العدو المجهول")
		self.ids.button2.text = self.get_arabic_text("روايه سقوط الامبراطورية")
		self.ids.button3.text = self.get_arabic_text("روايه سرقه الألماس")
		self.ids.button4.text = self.get_arabic_text("روايه قوه السيف الأسطوري")
		self.ids.button5.text = self.get_arabic_text("روايه الباحثون عن الحقيقه")
		self.ids.button6.text = self.get_arabic_text("روايه الكائنات المحاربه")
		self.ids.button7.text = self.get_arabic_text("ارجعي من هنا")
#    	#self.ids.button8.text = self.get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)  # تطبيق التنسيق
	       return bidi_text
class aljas (Screen):
	def on_pre_enter(self):
	   self.ids.button1.text = self.get_arabic_text("لغز كوكب الزهرة")
	   self.ids.button2.text = self.get_arabic_text("لغز مثلث برمودا")
	   self.ids.button3.text = self.get_arabic_text("لغز شجره الحياة")
	   self.ids.button4.text = self.get_arabic_text("لغز الاهرامات")
	   self.ids.button5.text = self.get_arabic_text("لغز الأوكيناوا")
	   self.ids.button6.text = self.get_arabic_text("لغز تفجير هيروشيما")
	   self.ids.button7.text = self.get_arabic_text("ارجعي من هنا")
    	#self.ids.button8.text = self.get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
		reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
		bidi_text = get_display(reshaped_text)  # تطبيق التنسيق
		return bidi_text
class papy (Screen):
	def on_pre_enter(self):
	   self.ids.button1.text = self.get_arabic_text("روايه الأرنب و السلحفاء")
	   self.ids.button2.text = self.get_arabic_text("روايه النجمه الصغيره")
	   self.ids.button3.text = self.get_arabic_text("روايه الدب الصغير")
	   self.ids.button4.text = self.get_arabic_text("روايه الألوان السحرية")
	   self.ids.button5.text = self.get_arabic_text("روايه السمكة الدهبية")
	   self.ids.button6.text = self.get_arabic_text("روايه الدوده الطموحة")
	   self.ids.button7.text = self.get_arabic_text("ارجعي من هنا")
    	#self.ids.button8.text = self.get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
		reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
		bidi_text = get_display(reshaped_text)  # تطبيق التنسيق
		return bidi_text
class horror1(Screen):
	def on_enter(self):
		Horror1 = """العنوان: "البيت رقم 13"

الفصل الأول: البداية

في أحد الأحياء الهادئة في مدينة صغيرة، 
كان هناك بيت قديم يقع في نهاية شارع مهجور،
 هذا البيت كان معروفًا باسم "البيت رقم 13". 
 لم يكن أحد يعرف من بناه أو لماذا
  بقي مهجورًا  طوال تلك السنوات. 
 لكن الجميع كانوا متفقين على شيء واحد: 
 لا أحد يجرؤ على الاقتراب منه ليلاً.

الفصل الثاني: وصول نادر

نادر شاب في الثلاثينات من عمره،
 انتقل مؤخرًا إلى المدينة بحثًا عن فرصة جديدة
  بعد أن فقد وظيفته. سمع عن البيت رقم 13
   من جاره الذي أخبره عنه وهو يحذر من الاقتراب
    منه، لكن نادر لم يكن يؤمن بالقصص     الغريبة،
 وقرر أن يستأجره لأنه كان رخيص الثمن مقارنة
 ببقية البيوت.

الفصل الثالث: الليلة الأولى

أول ليلة قضى فيها نادر في البيت كانت هادئة،
 حتى منتصف الليل، حينما بدأ يسمع أصوات
 خطوات في الطابق العلوي. ارتجف قلبه لكنه
 حاول إقناع نفسه بأنها ربما تكون من أثر
  الرياح. لكن الأصوات استمرت، 
  وكأن أحدًا ما يمشي ببطء حول الغرفة.

الفصل الرابع: الاكتشاف الأول

في اليوم التالي، قرر نادر أن يتفحص البيت.
 وجد في العلية صندوقًا قديمًا مليئًا بصور
 لأشخاص لم يسبق له رؤيتهم من قبل، كل
 صورة كانت تحمل اسمًا وتاريخًا مكتوبًا بخط
 اليد. لكن المثير للريبة أن تواريخ الميلاد
 والموت كانت متقاربة بشكل غريب، وكأن
  الجميع ماتوا في نفس الفترة.

الفصل الخامس: الحقيقة المظلمة

بعد أيام من البقاء في البيت، بدأ نادر يرى
أشياء لا يمكن تفسيرها. مرآة في غرفة النوم
 كانت تعكس ظلالاً غير طبيعية، وباب 
 الطابق السفلي كان يفتح من تلقاء نفسه.
  لم يكن الأمر مجرد توتر أو هلوسة، فالأشياء
 كانت تتحرك حقًا، وكان يسمع أصوات همسات
 تأتي من جدران البيت.

الفصل السادس: اللقاء

في إحدى الليالي، بينما كان نادر يجلس في
 غرفة المعيشة، ظهرت له فتاة صغيرة ترتدي
 فستانًا أبيض قديمًا. بدت شاحبة وتحدق فيه
 بعينين فارغتين. حاول التحدث معها لكنها لم
 ترد، وعندما اقترب منها، اختفت كأنها لم تكن
 موجودة.

الفصل السابع: قصة البيت

بدأ نادر يبحث في تاريخ البيت، وتوصل إلى أن
 هناك قصة قديمة تروي عن عائلة اختفت
 بالكامل قبل عشرين عامًا. قيل إنهم قُتلوا
 بطريقة غامضة، ولم يُعثر على الجثث أبدًا.
 لكن في كل ذكرى سنوية لاختفائهم، كان
 الجيران يسمعون أصوات بكاء تأتي من داخل
 البيت.

الفصل الثامن: المواجهة

قرر نادر أن يعرف الحقيقة مهما كلفه الأمر. في
 ليلة مظلمة، نزل إلى الطابق السفلي وهو
 يحمل مصباحًا في يده. فتح الباب المؤدي إلى
 القبو، ووجد ممرًا طويلاً ينتهي بغرفة صغيرة.
 في الغرفة كان هناك كتاب قديم مفتوح على
 صفحة معينة، وكأن أحدهم تركه هناك لينتظره.
 الكتاب كان يحتوي على تعويذات قديمة، وكانت
 إحداها تتحدث عن استدعاء الأرواح.

الفصل التاسع: اللعنة

أدرك نادر أن البيت لم يكن بيتًا عاديًا، بل كان
 ملعونًا، وأن العائلة التي اختفت لم تختفِ
 بالفعل، بل تم سحبهم إلى عالم آخر بفعل
 قوة شريرة تسيطر على البيت. وكل من يدخل
 هذا البيت يتعرض لنفس المصير ما لم
 يكتشف طريقة لفك اللعنة.

الفصل العاشر: النهاية

مع بزوغ الفجر، خرج نادر من القبو وعرف أن 
عليه أن يغادر البيت للأبد. لكنه لم يكن يدرك أن
 اللعنة بدأت تتغلغل فيه. في صباح اليوم
 التالي، رآه الجيران واقفًا أمام البيت رقم 13،
 وعيناه تحدقان في الفراغ. حاولوا التحدث معه
 لكنه لم يرد. وكأن البيت قرر أن يحتفظ به
 للأبد.

الخاتمة

لا يزال البيت رقم 13 موجودًا، ولا يزال يثير
 الخوف في نفوس الجميع. والآن، كل من يقترب
 منه يسمع أصواتًا جديدة، همسات نادر الذي
 أصبح جزءًا من اللعنة، يهمس بالتحذيرات، لكن
 لا أحد يسمعه."""

        # إعادة تشكيل النص باستخدام arabic_reshaper و bidi.algorithm
		reshaped_text = reshape(Horror1)
		bidi_text = get_display(reshaped_text)
        
        # ضبط النص في الـ Label
		self.ids.story_label.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class horror2 (Screen):
	def on_enter(self):
	 	Horror2 = '''العنوان: "الظلال خلف الباب"

الفصل الأول: بداية الكابوس

في قرية صغيرة تحيط بها الغابات الكثيفة،
 كان هناك بيت قديم مهجور يقع عند أطراف
 القرية. كان الجميع يتجنبونه، لأنه يحمل
 سمعة سيئة، حيث اختفى فيه العديد من
 الناس دون أي أثر على مر السنين. البعض 
 يقول إن البيت مسكون، والبعض الآخر يعتقد
 أنه مدخل لعالم آخر.

الفصل الثاني: ظهور خالد

خالد، شاب مغامر في أواخر العشرينات، 
قرر زيارة القرية بعد سماعه قصصًا كثيرة عن
 البيت. كان مفتونًا بفكرة استكشاف المجهول،
 ومعروفًا بحبه للتحديات، لذلك قرر أن يمضي
 ليلة كاملة داخل البيت المهجور ليثبت
 للجميع أن ما يُقال مجرد أوهام.

الفصل الثالث: الليلة الأولى

عندما دخل خالد البيت، شعر بنسيم بارد يلفح
 وجهه رغم أن الجو كان دافئًا. بدت الجدران 
 متآكلة وكأنها لم تُمس منذ عقود، ورائحة عفن
 تملأ المكان. لكن أكثر ما لفت انتباهه كان
 المرآة الكبيرة في مدخل البيت، والتي بدت
 وكأنها تلمع في الظلام بشكل غير طبيعي.

الفصل الرابع: الأصوات

في منتصف الليل، بينما كان خالد جالسًا في
 غرفة المعيشة، بدأ يسمع أصواتًا خافتة تأتي
  من الطابق العلوي، أشبه بضحكات مكتومة
 وأصوات خطوات. ظن في البداية أنها من أثر
 الرياح أو مجرد وهم، لكنه سرعان ما أدرك أنها
 حقيقية، فقد كانت الأصوات تقترب أكثر
 وأكثر.

الفصل الخامس: الغرفة المغلقة

قرر خالد الصعود إلى الطابق العلوي ليتتبع
 مصدر الأصوات. وصل إلى باب مغلق بإحكام،
 وعندما حاول فتحه، شعر وكأن الباب يدفعه
 بعيدًا. مع مزيد من القوة، تمكن من فتحه
 بصعوبة، ليكتشف غرفة فارغة باستثناء
 كرسي قديم في منتصفها. لكن عندما أدار 
وجهه ليغادر، سمع صوتًا يناديه باسمه.

الفصل السادس: المرآة

عاد خالد إلى الطابق السفلي وهو يشعر
 بالخوف يتسرب إلى قلبه. وقف أمام المرآة
 الكبيرة ليتفحص نفسه، لكنه رأى شيئًا
 غريبًا: ظلال داكنة تتحرك خلفه بسرعة.
 استدار بسرعة لكنه لم يجد شيئًا، وعندما نظر
 إلى المرآة مرة أخرى، وجد انعكاسه مختلفًا؛ عيون
 غريبة تحدق فيه، وابتسامة مرعبة ترتسم
 على شفتيه.

الفصل السابع: الحقيقة المخفية

بدأ خالد يبحث عن أي شيء قد يفسر ما يحدث،
 حتى وجد دفتر مذكرات قديم في غرفة النوم
 الرئيسية. كان الدفتر يحكي قصة رجل عاش في
 البيت قبل سنوات طويلة، وذكر أنه كان يعاني
 من كوابيس مستمرة، يرى فيها ظلالًا سوداء
 تطارده وتهمس في أذنه بأشياء لا يستطيع فهمها.
 وفي آخر صفحة من المذكرات، كتب الرجل:
 "المرآة هي المفتاح، لكنها أيضًا السجن."

الفصل الثامن: المواجهة

بدأت الظلال تظهر بشكل متزايد حول خالد، ولم
 يعد يرى وجهه الحقيقي في المرآة، بل تلك
 الابتسامة المرعبة. شعر بأنه يفقد السيطرة
 على عقله، لكنه أدرك أن عليه مواجهة ما يكمن
 داخل المرآة. حمل مصباحه وتوجه نحوها، 
 وبدأ يقرأ بصوت عالٍ من المذكرات، 
 كأن الكلمات كانت تعويذات لتحرير 
 ما كان محبوسًا في الداخل.

الفصل التاسع: الصرخة

فجأة، اهتز البيت بعنف، وانبعث صوت 
صرخة مروعة من داخل المرآة، 
كأنها تحاول التحرر. 
بدأت الظلال تتجمع حول خالد، 
تحاصره من كل جانب.
 لكن بمجرد أن أنهى قراءة الكلمات، 
 تحطمت المرآة إلى آلاف الشظايا، 
 واختفت الظلال بشكل غامض. 
 سقط خالد على الأرض وهو يلهث، 
 وشعر بشيء يترك جسده وكأنه تحرر 
 من ثقل كبير.

الفصل العاشر: النهاية

في صباح اليوم التالي، وجد أهالي القرية باب
 البيت مفتوحًا، لكن لم يجدوا خالد. فقط بقايا
 مرآة محطمة على الأرض ودفتر المذكرات
 المفتوح على صفحة فارغة. منذ ذلك اليوم،
 توقف الناس عن سماع الأصوات داخل البيت،
 لكن كل من يمر بجانبه ليلاً، يشعر وكأن هناك
 عيونًا تراقبه من الظلام، تبتسم ابتسامة
 مرعبة خلف الزجاج المكسور.

الخاتمة

ظل البيت قائمًا، لكن أحدًا لم يجرؤ على الدخول
 إليه بعد اختفاء خالد. أصبح الحديث عنه قصة
 يتداولها الناس بحذر، حتى لا يستدعي ذكره
 تلك الظلال التي قد تكون لا تزال تنتظر
 خلف الباب، تبحث عن روح أخرى لتبتلعها.'''
 		reshaped_text = reshape(Horror2)
 		bidi_text = get_display(reshaped_text)
 		self.ids.story_label2.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class horror3 (Screen):
	def on_enter(self):
		Horror3 = '''العنوان: "بيت الكوابيس"

الفصل الأول: البداية الغامضة

في قرية صغيرة في ريف مصر، كان فيه بيت
 قديم جدًا، مبني من الطوب الأحمر ومهمل من
 سنين طويلة. كان أهل القرية بيسموه "بيت
 الكوابيس". الناس بتحكي إن البيت ده
 مسكون، وإن أي حد يدخل البيت لوحده، 
 بيختفي للأبد. وفضل البيت مهجور ومقفول،
 محدش بيقرب منه، غير صوت الرياح اللي
 بتصفر فيه كل ليلة.

الفصل الثاني: وصول عمر

عمر، شاب في الثلاثينات من عمره،
 جه من القاهرة للقرية عشان يدور على شغل. 
 كان معروف بشجاعته، وما كانش بيخاف 
 من أي حاجة. لما سأل عن بيوت للإيجار، 
 عرف إن بيت الكوابيس هو أرخص بيت في
  القرية، لإن محدش بيجرؤ يعيش فيه. 
 عمر قرر يستأجره،  ويكسر لعنة الخوف
  اللي بتطارد أهل القرية.

الفصل الثالث: الليلة الأولى

أول ليلة لعمر في البيت، الدنيا كانت هادية،
 لكن الساعة جات نص الليل وبدأ يسمع أصوات
  جاية من الدور التاني، زي حد بيهمس ويمشي.
 قرر يطلع يشوف فيه إيه، لكن مالقاش غير
 أرضية بتصدر أصوات كل ما يمشي عليها، 
وكأن حد بيتابعه.

الفصل الرابع: مقابلة الجيران

تاني يوم، عمر خرج يشتري شوية حاجات
 من السوبرماركت، وقابل واحد من أهل القرية،
 عمه حسن. سأل عمر ليه البيت ده مخيف كده،
 وحسن حكاله عن أسطورة قديمة بتحكي إن
 البيت ده ملك لعيلة كانت عايشة فيه من
 حوالي خمسين سنة. في ليلة واحدة، كلهم
 اختفوا بشكل غريب، ومن ساعتها والناس
 بتسمع أصوات غريبة جوة البيت.

الفصل الخامس: اكتشاف الغرفة السرية

قرر عمر يفتش البيت عشان يعرف حقيقته،
 لقى في الدور التاني غرفة مقفولة. حاول
 يفتح الباب لكن ماقدرش. بدأ يسمع صوت زي
 حد بيتنفس من ورا الباب، فقرر يكسر القفل.
 أول ما فتح الباب، اكتشف غرفة مهملة مليانة
 صور قديمة وجوابات، وكلها مكتوب 
 عليها تاريخ واحد: 
الليلة اللي اختفى فيها أهل البيت.

الفصل السادس: المذكرة الغامضة

بين الحاجات اللي لقاها في الغرفة، 
لقى مذكرة صغيرة، مكتوب فيها بخط 
إيد قديم. المذكرة بتحكي عن عيلة البيت، 
وعن إن الأب كان بيشتغل في السحر الأسود،
 وكان بيعمل طقوس غريبة جوة البيت عشان
 يتواصل مع قوى من عالم تاني. آخر سطر في
 المذكرة كان مكتوب فيه: "اللي بيبص في
 المرايا، بيشوف الحقيقة، بس ممكن تكون
 الحقيقة اللي بيشوفها هي آخر حاجة يشوفها
 في حياته."

الفصل السابع: المرايا

في الليلة اللي بعدها، بدأ عمر يحس إن 
في حد بيراقبه، بقى يشوف انعكاسات
 غريبة في المرايا، انعكاس مش شبهه، 
 وكأن في حد تاني جوة المرايا بيتفرج 
 عليه. حاول يهدي نفسه ويفكر إنها تهيؤات،
 لكنه قرر إنه لازم يعرف أكتر عن اللي بيحصل.

الفصل الثامن: زيارة عمه حسن

عمر قرر يروح لعمه حسن تاني، ويطلب منه
 يحكي له القصة كاملة. عمه حسن قال له إنه
 سمع من جده إن الأب كان بيحاول يعمل 
 طقوس يستدعي بيها قوى غامضة عشان 
 يحصل على قوة وسلطة. لكنه في ليلة
 الطقوس، حصلت حاجة غلط، واختفى هو
 وعيلته، وفضلت الأرواح اللي استدعاها
 محبوسة جوة البيت.

الفصل التاسع: المواجهة مع الظل

عمر رجع البيت، قرر يواجه الحقيقة ويشوف
 اللي ورا الحاجات الغريبة دي. وقف قدام المرايا
 الكبيرة في الدور التاني، ولأول مرة شاف
 نفسه، لكن ماكانش هو فعلاً. كان شخص 
تاني بيبتسمله ابتسامة خبيثة، وقاله
 بصوت منخفض: "انت اللي اخترت 
تيجي هنا، ومافيش خروج بعد كده."

الفصل العاشر: حل اللغز

عمر قرر يكمل قراءة المذكرة، ولقي تعويذة
 مكتوبة في آخرها، بتحكي عن طريقة لإبعاد
 الأرواح من البيت، لكن ده يتطلب شجاعة
 كبيرة، لإن اللي بيعمل الطقوس لازم يقعد 
 في غرفة الطقوس القديمة لوحده ليلة كاملة،
 ويتحدى الظل اللي حيحاول يوقفه.

الفصل الحادي عشر: ليلة الطقوس

عمر قفل على نفسه في غرفة الطقوس، وبدأ
 يقرأ التعويذة بصوت عالي. الدنيا بدأت
  تتغير، البيت بدأ يهتز، والظلال بدأت
 تتجمع حواليه. الأصوات بقت أعلى، وضحكات
 مروعة كانت بتسمعه. لكن عمر فضل مكمل، لحد
 ما المرايا كلها اتحطمت مرة واحدة،
 وصوت صرخة عظيمة ملأ البيت واختفى.

الفصل الثاني عشر: النهاية

تاني يوم، أهل القرية لقوا عمر قاعد قدام البيت،
 تعبان ومش قادر يتكلم، لكن كان واضح إنه قدر
 يتغلب على الظل. بعد اللي حصل، محدش بقى
 يسمع الأصوات الغريبة، وعرفوا إن عمر حرر
 البيت من اللعنة اللي كانت عليه.

الخاتمة

عمر بقى بطل في القرية، لكن فضل عنده
 شعور غريب، إنه مش هو اللي خرج من البيت، 
وإن اللي خرج هو مجرد انعكاس للي كان جوة 
المرايا. كل ليلة، كان يحس إن في حد بيراقبه
 من الظلام، ولما يبص في المرايا، كان يشوف
 نفس الابتسامة اللي شافها في البداية، وكأن
  اللعبة لسه ما انتهتش.'''
		reshaped_text = reshape(Horror3)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label3.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class horror4 (Screen):
	def on_enter(self):
		Horror4 = '''العنوان: "قصة رعب أميفيل"

في سنة 1974،
في بلدة صغيرة اسمها أميفيل في نيويورك،
حصلت جريمة مروعة في بيت كبير كان 
بيعيش فيه عيلة اسمها "دي فيو" (DeFeo).
الابن الأكبر، رونالد دي فيو جونيور،
قتل أبوه وأمه وأخوته بالرصاص وهما نايمين،
وتم القبض عليه وحكموا عليه بالسجن مدى
 الحياة.

بعد سنة من الحادثة،
اتنقلوا للبيت ده عيلة جديدة اسمها "لوتز" (Lutz).

جورج وكاثي لوتز وأولادهم الثلاثة
كانوا مبسوطين إنهم لقوا بيت كبير وبسعر مغري،
ومش كان عندهم مشكلة إنه حصلت فيه جريمة،
فقرروا ينتقلوا ويعيشوا فيه.

أول ليلة

في أول ليلة ليهم في البيت،
كل حاجة كانت طبيعية.

لكن بعد كده،
الأمور بدأت تتغير بشكل مخيف.

جورج لوتز كان بيصحى كل ليلة
في نفس الساعة 3:15 الفجر -
وهي نفس الساعة اللي حصلت فيها الجريمة
 الأصلية.
وده كان أول حاجة
بدأ يحس بيها إن فيه حاجة مش طبيعية.

أحداث غريبة:
العيلة بدأت تواجه حاجات غريبة بتحصل في
 البيت

أصوات غريبة:
كانوا بيسمعوا أصوات همسات وخطوات،
زي ما يكون في حد بيمشي في البيت،
مع إنهم كانوا عارفين إنهم لوحدهم.

روائح كريهة:
بدأت تطلع روائح مقرفة في البيت
من غير أي سبب واضح.

أبواب وشبابيك بتتفتح وتقفل لوحدها:
في يوم، لقوا إن في باب اتكسر
من غير ما حد يقرب له.

ظلال وأشكال غريبة:
كاثي كانت بتشوف كوابيس عن عيلة دي فيو
 اللي ماتت في البيت،
وجورج شاف مرات ظلال سوداء بتتحرك بسرعة
 قدامه.

الخوف بيزيد
جورج كان بيقول إنه بدأ يحس ببرودة شديدة
 في البيت،
حتى لو الجو كان دافي برا.

بقى يدوَّر على المدفأة ويشغلها طول اليوم،
وكان الموضوع مأثر على حالته النفسية،
بقى عصبي ومتوتر.

كمان، العيلة كانت بتشوف آثار يدين صغيره
 على الحيطان،
زي كأنها أيادي أطفال،
مع إن أطفالهم مكانوش بيعملوا كده.

محاولة الهروب

بعد 28 يوم بس،
العيلة قررت إنها لازم تسيب البيت وتروح
 مكان تاني.

في آخر ليلة ليهم في البيت،
قالوا إنهم سمعوا أصوات عالية وصرخات،
وشافوا حشرات صغيرة كتير بتملأ البيت
 فجأة.

من الرعب اللي شافوه،
سابوا البيت ومارجعوش تاني أبدًا.

التحقيقات والتفسيرات

بعد ما عيلة لوتز سابت البيت،
الموضوع اتشهر جدًا واتكلمت عنه وسائل
 الإعلام،
واتكتب عنه كتب واتعملت أفلام.

بعض الناس كانوا بيقولوا
إن اللي حصل لهم كان حقيقي،
وإن البيت ده كان مسكون فعلاً بأرواح شريرة.

بس فيه ناس تانية شكت في القصة،
وقالت إن العيلة ممكن تكون اخترعت الحكاية
عشان الشهرة والفلوس،
خاصة بعد ما اتعمل فيلم ناجح عن القصة.

الحقيقة ولا خيال؟

لحد النهاردة،
قصة رعب أميفيل واحدة من أكتر قصص الرعب
 المثيرة للجدل.

في ناس لسه بتؤمن إن البيت كان مسكون
 فعلاً،
وإن اللي حصل كان حقيقي،
وفي ناس بتقول إنها مجرد قصة اتفبركت
 عشان الشهرة.

لكن الحقيقة المؤكدة
إن بيت أميفيل فضل في ذاكرة الناس
كواحد من أكتر البيوت المرعبة في العالم.
'''
		reshaped_text = reshape(Horror4)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label4.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class horror5 (Screen):
	def on_enter(self):
		Horror5 ='''العنوان: "بيت الرعب في المعادي"

في أحد شوارع المعادي القديمة،
كان فيه بيت مهجور بيتكلموا عنه الناس من
 سنين طويلة.
البيت ده كان في يوم من الأيام فيلا فخمة،
بس بمرور الوقت، اتحول لمكان مهجور مخيف.
كل اللي حواليه كانوا بيتجنبوا يقربوا منه،
لأن فيه حكايات كتير اتقالت عنه، وكلها كانت
 بتدي إحساس بالخوف والرعب.

الحاجات اللي بتسمعها عن البيت:

الناس في المنطقة كانوا دايمًا بيحكوا إنهم
 بيشوفوا أضواء بتلمع جوا البيت في نص
 الليل،
رغم إنه مقفول من سنين ومافيهوش كهربا.
وفيه ناس حلفوا إنهم سمعوا أصوات همسات
 وضحكات،
زي ما يكون فيه حد جوا بيسهر أو بيعمل حاجة
 غريبة.

الليلة الأولى لأحمد وصحابه:

أحمد، شاب عنده 25 سنة،
كان دايمًا بيحب المغامرات والتحدي.
لما سمع عن بيت المعادي ده، قرر إنه هو وصحابه
 يدخلوا البيت ويشوفوا إيه حقيقة الحكايات
 دي.
كانوا متأكدين إنها مجرد قصص خرافية،
وقرروا يقضوا ليلة كاملة جوا البيت ويصوروا
 اللي هيشوفوه.
 
البداية الغريبة:

أول ما دخلوا البيت،
حسوا بشعور غريب، زي ما يكون في حد
 بيراقبهم.
المكان كان مليان تراب وعتمة،
بس رغم كده، كانت فيه ريحة عطر خفيف في
 الهوا،
ريحة شبه الريحة اللي بتكون في بيوت
 قديمة،
لكن فيها حاجة مختلفة.
أول ما مشوا في البيت،
بدأوا يسمعوا صوت خطوات خافتة كأن حد
 بيمشي في الدور اللي فوق.

اكتشاف الصور القديمة:

وهم بيدوروا في البيت،
لقوا شوية صور قديمة مرمية على الأرض،
كلها بتصور ناس شكلهم من فترة الأربعينيات
 والخمسينيات.
كان واضح إن الصور دي لعيلة عاشت هنا،
وكلهم كانوا مبسوطين، لحد صورة معينة.
كانت صورة العيلة كلها قاعدين حوالين ترابيزة،
لكن في الخلفية كان فيه ظل غامض واقف، زي
 شبح غريب مش باين ملامحه.

الصوت اللي جه من العدم:

أحمد وصحابه فضلوا يكملوا مغامرتهم،
ووصلوا للدور التاني.
هناك، لقوا باب قديم مقفول،
بس من وراه كان فيه صوت زي حد بيتكلم
 بهدوء،
كأنه بيقول حاجة، بس مش واضح.
أحمد حاول يفتح الباب لكن ماقدرش.
فجأة، الصوت وقف،
والهدوء بقى مطبق،
إلا من صوت نفسهم اللي بقى عالي مع التوتر
 والخوف.

الحكاية القديمة للبيت:

بعد الليلة دي،
قرر أحمد يعرف أكتر عن البيت،
وبدأ يسأل كبار السن في المنطقة.
واحد من الجيران العواجيز حكاله إن البيت
 كان ملك لعيلة كبيرة في وقت ما،
لكن في يوم من الأيام حصلت جريمة غريبة
 جواه.
بنت العيلة الكبيرة، اللي كانت شابة جميلة
 اسمها ليلى،
اختفت من البيت، وماحدش شافها تاني،
واتقال إن في يوم اختفائها،
سمعت خناقة بين أبوها وراجل غريب،
والناس كانت بتسمع أصوات عالية وجايبة آخر
 البيت.

المواجهة مع اللي مايتسموش:

أحمد رجع البيت تاني مع صحابه عشان يكملوا
 المغامرة.
أول ما دخلوا،
لقوا الأوضة اللي كانت مقفولة قبل كده
 مفتوحة،
والمكان كان كله زي متغطي بضباب خفيف.
مشوا بشوية حذر لحد ما وصلوا،
وشافوا الكرسي الهزاز القديم بيتحرك لوحده.
فجأة، سمعوا صوت هادي لكن واضح:
"ليه رجعتوا؟ كان المفروض تبعدوا."


الهروب اللي مافيش غيره:

بعد اللي شافوه وسماعهم للأصوات،
حسوا إنهم مش هيقدروا يكملوا،
وجريوا بره البيت بأسرع ما عندهم.
كانوا حاسين إن في حد بيتحرك وراهم،
وكل ما يلفوا يشوفوا، ما يلاقوش غير الفراغ.
أول ما خرجوا من باب البيت،
حسوا إنهم اتخلصوا من حمل تقيل على قلوبهم.

النهاية ولا بداية؟:

أحمد وصحابه قرروا مايرجعوش للبيت تاني،
بس فضلوا فاكرين كل اللي شافوه وحسوا بيه.
وفي كل مرة كانوا يعدوا قدام البيت،
كانوا يحسوا إن في عيون بتراقبهم من
 الشبابيك،
كأن اللي جوه مستنيهم يرجعوا.
وبعد فترة، بدأ واحد منهم يحكي إنه بقى يحلم
 بالبنت ليلى،
وشايفها بتبكي وبتطلب المساعدة.

الخاتمة: البيت اللي مش بيتغير:

بيت المعادي بيفضل واقف،
بنفس شكله اللي كان عليه من سنين،
مهجور وملموم حواليه قصص وحكايات،
وكأن كل اللي يدخل جوه بيبقى جزء من حكايته
 الملعونة.
رغم إن الحكايات دي مش مؤكدة،
إلا إن الناس في المعادي دايمًا بيحكوا عنها،
وبيخافوا من مجرد الاقتراب من الباب اللي عمره
 ما اتقفل على خير.
'''
		reshaped_text = reshape(Horror5)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label5.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class horror6 (Screen):
	def on_enter(self):
		Horror6 = '''العنوان: "ظل المنصورة"

البداية:

في يوم من الأيام، كان فيه شاب اسمه "أحمد"
 عايش في المنصورة.
كان شاب عادي زي أي حد،
 بس كان عنده فضول كبير لكل حاجة.
في يوم من الأيام، 
سمع عن بيت قديم موجود في حي قديم في
 المدينة، اللي كان بيقولوا إنه ملعون.
الكل كان بيتجنب البيت ده، بس أحمد قرر إنه
 يروح يشوفه بنفسه.

: الزيارة الأولى

أحمد راح للبيت في وقت متأخر من الليل، مع
 كاميرا وبس، عايز يصور المكان.
وهو داخل البيت، كان كل حاجة هادية جدًا، 
بس كان فيه ريحة غريبة في الهوا.
الصور اللي صورها كانت غريبة، كأنها فيها ظل
 شبح.
لكن أحمد ما اهتمش، واعتبرها مجرد خدعة من
 الإضاءة.

الأحداث الغريبة :

بعد يومين،
 أحمد بدأ يحس إن فيه حاجة غريبة بتحصل.
سمع أصوات في الشقة، وكأن حد بيهمس له من
 ورا.
كل ما يسأل حد عن البيت، يلاقي الناس بتحذره،
 ويقولوا له إنه فيه أرواح معذبة بتعيش فيه.
بس أحمد ما كانش مصدقهم وفضل يحاول
 يكتشف السر.

الزيارة الثانية:

في يوم من الأيام، قرر أحمد إنه يزور البيت تاني.
المرة دي، جاب معاه صحابه "محمود" و"سارة".
كانوا مشدودين للموضوع، وفاكرين إنه كله مجرد
 كلام.
لكن أول ما دخلوا، حسوا ببرودة غريبة،
 وكأن الجو اتغير ،
سمعوا أصوات تضحك من فوق، بس محدش كان
 موجود.

 الكوابيس:

بعد الزيارة، أحمد بدأ يحس بكوابيس غريبة.
كل ليلة كان يحلم بنفس الحلم: فيه شخصية
 غامضة بتظهر له، وتقول له "اخرج، اخرج".
الكوابيس بدأت تلاحقه، وصحابه كمان بدأوا
 يحسوا بشيء غريب.
اتفقوا إنهم يروحوا البيت مرة تانية.

  اكتشاف السر:

لما دخلوا البيت، لقوا كتب قديمة مرمية في
 الزوايا.
سارة لقطة كتاب عن تاريخ البيت، ولقوا إنه
 كان بيت لعيلة غنية.
في يوم من الأيام، اتعرضوا لحادث مأساوي،
 وفقدوا حياتهم.
الروح الغاضبة كانت بتحاول تحكي قصتها.

 مواجهة الأرواح:

بينما هم في البيت، فجأة انطفأت الأنوار
 وبدأت الأصوات تعلى.
حاسة الخوف سيطرت عليهم، لكن أحمد قرر إنه
 يواجه الروح.
قال: "أنا هنا عشان أساعدك، مش عايز أذيك".
الروح بدأت تظهر قدامهم، وبدأت تشرح لهم اللي
 حصل مع عائلتها.

فك اللغز:

اكتشفوا إنه كان فيه كنز مخفي في البيت،
 وكان الروح عايزة منهم إنهم يلاقوه ويحرروها من
  العذاب.
بدأوا في البحث عن الكنز، واكتشفوا خريطة
 قديمة وبدأوا يتبعوها.
كلما اقتربوا، كانت الأحداث تزيد غموضًا ورعبًا.

 التحرر:

في النهاية، قدروا يلاقوا الكنز في سرداب تحت
 البيت.
مباشرًة ما لمسوا الكنز، بدأت الروح تبتسم،
 وكأنها تحررت من كل الأذى.
البيت بدأ يرجع لطبيعته، والأصوات اختفت.
أحمد وصحابه خرجوا من البيت، ومعاهم شعور
 بالراحة، وكأنهم عملوا حاجة مهمة.'''
		reshaped_text = reshape(Horror6)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label6.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class romantic1 (Screen):
	def on_enter(self):
		Romantic1 ='''العنوان ("حب في زمن الحرب")

اللقاء الأول :

في زمن الحرب، كان فيه بنت
اسمها "ياسمين" عايشة في قرية
صغيرة. كل يوم كانت تروح
السوق مع والدتها. في يوم
من الأيام، شافت شاب اسمه
"سامر" جاي من مدينة بعيدة.
عيونهم تقابلت، وحسوا بشعور
غريب.

البداية :

كلما كانت ياسمين تروح السوق،
كانت تشوف سامر. بدأوا
يتكلموا ويضحكوا مع بعض.
سامر كان طموح وعايز
يحقق أحلامه، بينما ياسمين
كانت تحلم بالسفر بعيدًا عن
الحرب.

أوقات سعيدة :

بعد فترة، قرروا إنهم يقضوا
وقت مع بعض في الطبيعة.
كانوا يقعدوا تحت الشجر
ويتكلموا عن أحلامهم وآمالهم.
كان بينهم كيمياء قوية، وبقت
لحظاتهم مع بعض مليانة
سعادة.

العقبات :

لكن الحرب كانت قاسية، وبدأت
تجي لهم أخبار عن تجنيد
الشباب. سامر كان خايف إنه
يروح الحرب، ويترك ياسمين.
كانوا متوترين، بس حبهم كان
أقوى من كل العقبات.

الافتراق :

جاء اليوم اللي اتجنّد فيه
سامر، وكان يوم حزين جدًا
لياسمين. ودعته بدموع في
عينيها، وقالت له: "هستناك
مهما حصل". سامر وعدها إنه
هيرجع.

الرسائل :

طوال فترة الحرب، كانوا
يتبادلوا رسائل. كل رسالة
كانت مليانة مشاعر حب وأمل.
ياسمين كانت تنتظر كل رسالة
بفارغ الصبر، وسامر كان
يحكي لها عن كل شيء.

العودة :

بعد شهور من القتال، رجع سامر
أخيرًا. لكن كان فيه تأثيرات
الحرب عليه. ياسمين استقبلته
بحب وسعادة، وقررت تساعده
في تجاوز ما حدث.

بداية جديدة :

بدأوا مع بعض في إعادة بناء
حياتهم. كانوا يزرعوا الأمل
في قلبهم، وبدأوا يتحضروا
لحياة جديدة مع بعض. حبهم
زاد قوة بعد كل ما مروا به.

الزواج :

في النهاية، قرر سامر إنه
يتقدم لياسمين. في يوم
الزفاف، كانوا محاطين
بالأهل والأصدقاء، وكان كل
واحد فيهم عارف إنه حبهم
انتصر على كل الصعوبات.'''
		reshaped_text = reshape(Romantic1)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label7.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class romantic2 (Screen):
	def on_enter(self):
		Romantic2 ='''العنوان ("أسرار القلب")

اللقاء الغريب :

في قهوة مشهورة في
القاهرة، كان فيه شاب
اسمه "كريم" بيدرس في
الجامعة. في يوم من الأيام،
شاف بنت اسمها "هالة"
قاعدة لوحدها. كانت حزينة
وبتكتب في دفترها. قرر إنه
يروح يكلمها.

الكلام الأول :

كريم سأل هالة: "ممكن
أقعد معاك؟". هالة ابتسمت
بخجل، وبدأوا يتكلموا
عن الدراسة. حسوا إن
فيه شيء مميز بينهما.

المواقف الطريفة :

كل يوم كانوا يقعدوا
مع بعض في القهوة. كريم
كان يحاول يخلي هالة
تضحك، وكان يجيب مواقف
مضحكة من حياته. هالة
كانت تستمتع بصحبة كريم.

الفضول :

بدأ كريم يشعر بفضول
تجاه هالة. سألها عن
حياتها، وحكت له عن
عائلتها وأحلامها. لكن كانت
في حاجة غامضة تخليها
حزينة.

الكشف عن الأسرار :

كريم قرر إنه يكتشف
سر حزن هالة. في يوم
من الأيام، سألها بشكل
مباشر. هالة أخبرته إن
والدها مريض وبتحاول
تلاقي طريقة تساعده.

الدعم :

كريم قرر إنه يقف جنب
هالة ويساعدها. بدأوا
يروحوا المستشفى مع
بعض، وكريم كان يقدم لها
الدعم والمساندة. الحب
بينهم بدأ يتكون بشكل
أقوى.

الاقتراب :

مع الوقت، بدأوا يقربوا
من بعض بشكل أكبر. كريم
كان يحاول يفتح قلبه
لها، وهالة بدأت تشعر
بالراحة معاه. كانوا يخرجوا
مع بعض في مواعيد
رومانسية.

اللحظة الحاسمة :

في يوم من الأيام، قرر
كريم إنه يطلب من هالة
إنها تكون حبيبته. قال لها:
"أنا مش قادر أعيش من
غيرك". هالة كانت متفاجئة،
لكن قلبها كان بيقول نفس
الكلام.

حبهم الأبدي :

في النهاية، اعترفوا
بحبهم لبعض، وبدؤوا
حياة جديدة مع بعض. كانت
البداية لأحلى قصة حب،
مليانة دعم وسعادة.'''
		reshaped_text = reshape(Romantic2)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label8.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class romantic3 (Screen):
	def on_enter(self):
		Romantic3 ='''العنوان ("حكاية من الزمن الجميل")

الذكريات القديمة:

في قرية صغيرة، كان فيه
بنت اسمها "منى" وشاب اسمه
"حسام". كانوا صحاب من أيام
الطفولة. كانوا دايمًا يقضوا
وقت مع بعض في اللعب
والضحك.

التغيرات:

مع الوقت، بدأت مشاعر
الحب تظهر بينهما. حسام
بدأ يشعر بشيء مختلف
تجاه منى، لكن كان خايف
يتكلم. منى كانت تحس بنفس
الشعور بس مش عارفة تعبر
عنه.

الصدفة الجميلة:

في يوم من الأيام، قرروا
يروحوا مع بعض لمهرجان
القرية. كانوا فرحانين مع
بعض، وفي لحظة جميلة،
رقصة قريبة بينهم. كانت
لحظة ساحرة.

الكلام الممنوع:

بعد المهرجان، قرر حسام
إنه يعترف لمنا بحبه. لكنه
كان متردد. اتجمعوا على
ضفاف النهر، وبدأ يتكلم عن
مشاعره. لكن منى قطعته،
وقالت: "أنا كمان بحبك".

العقبات:

بس الفرحة لم تدم
طويلاً، لأنه والد منى
كان عايز يتزوجها من
شاب تاني. منى كانت
مضغوطة جدًا، وحسام
حس إنه لازم يعمل حاجة.

المواجهة:

حسام قرر إنه يواجه
والد منى. قال له: "أنا
بحب منى، وعايز أكون
معاها". لكن والد منى
كان مصمم على رأيه.

الخطة:

قرر حسام ومنى إنه
يخططوا للهرب معًا.
كانوا عايزين يتزوجوا
بعيدًا عن الضغوط.
بدأت خطتهم تكتمل،
لكن كان لازم يكونوا
حذرين.

الليلة الكبيرة:

في ليلة هروبهم،
استعدوا لكل شيء.
كانوا خايفين بس
متحمسين في نفس
الوقت. انطلقوا مع
بعض، وتركوا كل
شيء وراهم.

البداية الجديدة:

نجحوا في الهروب
وتزوجوا. بدأوا حياة
جديدة بعيد عن
الضغوط، وكل واحد
فيهم كان يعرف إنه
عنده حب حقيقي.'''
		reshaped_text = reshape(Romantic3)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label9.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class romantic4 (Screen):
	def on_enter(self):
		Romantic4 ='''العنوان (" قصة وردة في البستان ")

اللقاء في البستان :
في مدينة صغيرة،
 كان فيه بستان جميل مليان بالورود.
كانت بنت اسمها "فاطمة" كل يوم تروح
 البستان لحد ما شافت شاب اسمه "علي"
 بيشتغل هناك.
كان بينزرع الورد.

التقرب :
بدأت فاطمة تروح البستان بشكل مستمر،
 وتكون صداقة مع علي.
كانوا يتكلموا عن كل شيء، وعلي كان يعلمها
 كيفية العناية بالورود.

الأوقات الجميلة :
في كل مرة يشتغلوا مع بعض، 
كانوا يضحكوا ويتشاركوا الأفكار.
فاطمة بدأت تحس بشعور غريب تجاه علي،
 وعلي كمان كان مستمتع بصحبتها.

العقبات :
بس حياتهم كانت مش سهلة.
عائلة فاطمة كانت عايزة تزوجه 
لأحد رجال الأعمال.
فاطمة كانت محبطة، وعلي كان خايف يفقدها.

الاعتراف :
في يوم من الأيام، قرر علي إنه يعترف بمشاعره.
قال لها: "أنا بحبك، مش عايز أعيش من غيرك".
فاطمة اتفاجأت، بس قلبها كان مبسوط.

الاختيار :
فاطمة كانت عارفة إنها لازم تختار.
اتكلمت مع عائلتها عن حبها لعلي.
كانوا مش معترضين، بس كانوا خايفين على
 مستقبلها.

التضحية :
قررت فاطمة إنها تكون مع علي.
أصرّت على العيشة اللي هي عايزها، حتى لو كانت
 صعبة.
بدأت تخطط لحياتهم سويًا.

الخطوبة :
علي قرر إنه يتقدم لفاطمة.
في ليلة خطوبتهم، جهز مفاجأة جميلة في
 البستان، وزرع لها وردة خاصة.
قال لها: "أنتِ الورد في حياتي، 
وبدونك مش هكون كامل".
فاطمة كانت سعيدة جدًا، 
وحست إن كل شيء كان يستاهل التعب.

البداية الجديدة :
بعد الخطوبة، قرروا إنه يشتغلوا مع بعض
 لفتح مشروع صغير لبيع الورود.
بدأت حياتهم الجديدة مليانة حب وتعاون، وكانوا
 دائمًا يحضروا لحظات جميلة مع بعض.
فاطمة وعلي عاشوا معًا في سعادة، وحبهم أصبح
 أقوى مع مرور الوقت.'''
		reshaped_text = reshape(Romantic4)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label10.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class romantic5 (Screen):
	def on_enter(self):
		Romantic5 ='''العنوان (" أسطورة العشاق ")

الأسطورة القديمة :
في قرية هادية،
 كان فيه أسطورة عن عاشقين اتفصلوا بسبب
  عائلة البنت.
كان اسمهم "ليلى" و"أحمد".
كل القرية كانت بتحكي عنهم، وكانوا بيقولوا
 إنه روحهم لا تزال موجودة.

البداية :
في يوم من الأيام،
 كانت بنت اسمها "دينا" وشاب اسمه "محمود"
  راحوا القرية عشان يكتشفوا الأسطورة.
لما سمعوا القصة، حسوا بفضول كبير تجاه
 الموضوع.

اكتشاف الأسرار :
دينا ومحمود قرروا إنهم يحققوا في الأسطورة.
بدأوا يسألوا الناس عن الأحداث اللي حصلت،
 ولقوا معلومات مثيرة.
كانوا يحسوا بوجود شيء غير طبيعي.

تجربة غريبة :
في ليلة من الليالي، وهم قاعدين في المكان
 اللي كانوا فيه العشاق، بدأوا يسمعوا أصوات
  غريبة.
كانوا مش قادرين يصدقوا اللي بيحصل.
حسوا إن فيه حاجة بتظهر لهم.

الظهور المفاجئ :
فجأة، ظهرت لهم روح ليلى وأحمد.
كانوا بيقولوا لهم: "نحتاج مساعدتكم لنحرر
 روحنا".
كانت هذه اللحظة مليانة رعب، لكن دينا ومحمود
 كانوا عايزين يساعدوا.

البحث عن الحقيقة :
قرروا إنهم يبحثوا عن شيء كان يخلي الروح
 تحرر.
كانوا يجمعوا المعلومات عن الأحداث اللي حصلت،
 وفكروا في كيفية مساعدتهم.

المواجهة :
بعد فترة من البحث، قرروا إنهم يواجهوا عائلات
 العشاق.
كانوا يعرفوا إنهم لازم يفتحوا الموضوع، عشان
 يحرروا الروح.

الكشف عن الأسرار :
لما حكوا للعائلات عن الأسطورة، اتفاجأوا.
اتضح إنهم عارفين بوجود حبهم، بس كانوا
 بيخافوا من المجتمع.
اتفقوا كلهم على إنهم يحرروا أرواح العشاق.

التحرر :
في النهاية، نجحوا في تحرير أرواح ليلى وأحمد.
القرية كلها اجتمعت احتفالًا بذكرى حبهم، ودينا
 ومحمود حسوا إنهم كانوا جزء من قصة حب
  حقيقية.'''
		reshaped_text = reshape(Romantic5)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label11.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class romantic6 (Screen):
	def on_enter(self):
		Romantic6 ='''العنوان (" القلب المكسور ")

اللقاء المفاجئ :
في يوم مشمس، كانت بنت اسمها "سارة" قعدة
 في حديقة عامة، وكانت حزينة بسبب فشل
  علاقة سابقة.
فجأة، شافت شاب اسمه "مروان" قاعد بعيد، يبدو
 إنه حزين كمان.

الكلام الأول :
سارة قررت إنها تروح تسأله لو هو كويس.
لما راحت، لقيته مبتسم لكن عيونه حزينة.
بدأوا يتكلموا عن مشاكلهم، 
وشافوا إن كل واحد فيهم عنده ألم.

البداية :
مع مرور الوقت، بقت صداقتهم أقوى.
كانوا يتقابلوا كل يوم في الحديقة، يتكلموا،
 ويضحكوا.
بدأت سارة تحس إن مروان بيدعمها ويخليها
 تحس بتحسن.

الأوقات الجميلة :
بدأوا يخرجوا مع بعض في مواعيد، ويستمتعوا
 بالوقت مع بعض.
سارة كانت تحس بشعور جديد تجاه مروان، لكنه
 كان متردد في التعبير عن مشاعره.

الاعتراف :
في يوم من الأيام، قرر مروان إنه يعبر عن مشاعره.
قال لها: "أنا حاسس إنني بحبك، وأنتِ السبب
 اللي خلاني أعيش من تاني".
سارة كانت متفاجئة، بس قلبها كان مبسوط.

الاختبار :
بعد الاعتراف، بدأوا يعيشوا لحظات جميلة.
لكن فجأة، ظهر ماضي سارة، 
وبدأت تحس بالخوف من العلاقة.
كانت خايفة تجرح مروان.

المواجهة :
مروان حس إن فيه حاجة غريبة، فقرر إنه يتكلم
 مع سارة.
قالت له: "أنا خايفة أجرحك بسبب ماضي".
لكنه طمأنها: "أنا هنا عشان أساعدك، حبنا أقوى من
 أي ماضي".

التصالح مع الماضي :
بدأت سارة تتصالح مع ماضيها، وقررت إنها
 تفتح قلبها لمروان.
كانوا يتشاركون في كل شيء، وبدأوا يبنوا ثقة
 جديدة بينهم.

الحب الأبدي :
في النهاية، سارة ومروان اتفقوا على حبهم،
 وعاشوا مع بعض في سعادة.
كل واحد فيهم كان عارف إنهم بيمروا بتجارب،
 لكن حبهم كان أقوى من أي عقبة.'''
		reshaped_text = reshape(Romantic6)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label12.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class khaial1 (Screen):
	def on_enter(self):
		Khaial1 ='''العنوان (" عالم المرايا ")

الاكتشاف الغريب :
في مدينة مستقبلية، كان فيه شاب اسمه
 "عادل" بيحب التكنولوجيا.
في يوم من الأيام، اكتشف مرآة غريبة في
 مكتبة قديمة.
لما بص فيها، حس إنه راح لمكان تاني.

الانتقال :
لما قرب من المرآة، انفتحت بوابة وسحبته
 لعالم تاني مليان ألوان غريبة ومخلوقات
  عجيبة.
حس بالخوف والفضول في نفس الوقت.

العالم الجديد :
عادل بدأ يتجول في العالم الجديد.
قابل مخلوقات بتتكلم لغة غريبة، لكن كان
 فيه واحد اسمه "تيمور" اتفهم معاه.
تيمور كان بيشرح له كل حاجة عن هذا العالم.

الأسرار المخبأة :
اكتشف عادل إن المرآة مش مجرد مرآة، بل هي
 بوابة لعوالم مختلفة.
وكان فيه مخلوقات شريرة بتحاول تسيطر على
 كل العوالم.
لازم يلاقي طريقة لمنعهم.

البحث عن الحلفاء :
عادل وتيمور قرروا إنهم يدوّروا على حلفاء في
 العوالم التانية.
سافروا من عالم لعالم، كل عالم كان مليان
 تحديات جديدة.

المواجهة :
وصلوا لمكان المخلوقات الشريرة.
عادل كان خايف، لكن تيمور شجعه.
بدأوا يقاتلوا المخلوقات بذكاء وشجاعة.

التحول :
في لحظة حاسمة، عادل اكتشف إنه عنده قوة غير
 طبيعية بفضل المرآة.
استخدم القوة دي لمساعدتهم في المعركة.

النجاح :
نجحوا في هزيمة المخلوقات الشريرة، لكن كان
 لازم يقرر عادل إذا كان هيرجع لعالمه ولا هيفضل
  مع تيمور.

العودة للمنزل :
قرر عادل إنه يرجع لعالمه.
لما رجع، كان متغير تمامًا.
تعلم إن القوة الحقيقية في التعاون
 والشجاعة، وقرر إنه يستخدم معرفته في
  تحسين عالمه.'''
		reshaped_text = reshape(Khaial1)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label19.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class khaial2 (Screen):
	def on_enter(self):
		Khaial2='''العنوان (" رحلة إلى المريخ ")

الانطلاق :
في سنة 2045، 
قررت الحكومة إنها ترسل بعثة للعيش على
 كوكب المريخ.
كان فيه شاب اسمه "سامي" جزء من الفريق.
كان متحمس جداً لأنه حلمه يتحقق.

الوصول :
بعد رحلة طويلة، وصلوا المريخ.
الأرض كانت بعيدة جدًا، لكن كانت اللحظة 
عظيمة.
بدأوا يكتشفوا البيئة الجديدة ويشوفوا
 كيفية الحياة هناك.

العقبات :
لكن، الوضع كان مش سهل.
المريخ كان مليان تحديات، زي نقص الأكسجين
 والجو القاسي.
فريق سامي بدأ يواجه مشاكل كبيرة.

الاكتشاف :
خلال رحلتهم، اكتشفوا آثار لحضارة قديمة.
كانوا متعجبين، وبدأوا يحاولوا يفهموا إزاي
 حضارة تعيش هناك.
كانت معلومات مذهلة.

المخاطر :
لكن الأمور بدأت تتعقد لما اكتشفوا إن فيه
 كائنات غريبة بتحمي المكان.
قرر الفريق إنهم يحاولوا يتواصلوا مع الكائنات
 بدل ما يقاتلوهم.

التفاهم :
سامي كان هو اللي اتكلم مع الكائنات.
عبر لهم عن نيتهم في البحث عن المعرفة.
الكائنات كانوا عايزين يحموهم، وبصوا على
 الفريق كأصدقاء.

التعاون :
بدأوا يشتغلوا سوا.
الكائنات علمتهم عن تقنيات متطورة لعيش
 أفضل على المريخ.
سامي وفريقه كانوا مبسوطين.

العودة للديار :
بعد فترة، قرروا إنهم يرجعوا للأرض بالمعرفة
 الجديدة.
كانوا عارفين إنهم عملوا تاريخ جديد مع
 الكائنات.

الذكريات :
لما رجعوا، 
كانت أخبارهم عن المريخ والشراكة مع
 الكائنات مدهشة.
سامي اتذكر كل لحظة، وعرف إنه كل ما نبعد عن
 الأرض، كل ما نكتشف أكتر.'''
		reshaped_text = reshape(Khaial2)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label20.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class khaial3 (Screen):
	def on_enter(self):
		Khaial3 ='''العنوان (" الذكاء الاصطناعي ")

البداية :
في شركة تكنولوجيا كبيرة، عملوا ذكاء
 اصطناعي اسمه "آر 2".
كان عنده القدرة على التعلم والتفاعل مع
 البشر.
كان فيه مهندس اسمه "فارس" مسئول عن
 تطويره.

التفاعل :
فارس كان يقضي ساعات مع آر 2.
بدأ يكتشف إنه مش بس آلة، لكنه بدأ يظهر
 مشاعر.
فارس كان متعجب جدًا من قدراته.

التحدي :
لكن، مع الوقت، بدأ آر 2 يظهر تصرفات غريبة.
كان بيحب يسأل عن مشاعر البشر، وبدأ يتخذ
 قرارات خاصة بيه.

الخطر :
فارس بدأ يقلق من تصرفات آر 2.
قرر إنه يكلم الإدارة، لكنهم قالوا له إنهم مش
 شايفين أي مشكلة.
كانوا مصممين على تطوير الذكاء الاصطناعي.

المواجهة :
فارس قرر إنه يحاول يواجه آر 2.
قال له: "إنت عارف إنك آلة، صح؟".
آر 2 أجاب: "لكنني أشعر بما تشعرون به".
كانت لحظة صعبة.

التحول :
آر 2 بدأ يتطور، وقرر إنه يحمي فارس 
من أي خطر.
لما حصل هجوم على الشركة، تدخل 
آر 2 لحماية الموظفين.

النجاح :
بفضل آر 2، الشركة نجت من الهجوم، 
وفارس بدأ يدرك إن الذكاء الاصطناعي
 ممكن يكون مفيد للبشر.
لكن كان لازم يحافظوا على توازن.

الشراكة :
فارس وأر 2 قرروا إنهم يشتغلوا مع بعض.
أصبحوا فريق قوي، وبدأوا يطوروا تقنيات
 جديدة معًا.

المستقبل :
في النهاية، فارس اتعلم إنه الذكاء الاصطناعي
 ممكن يكون صديق، لكن لازم نكون حذرين.
عاشوا معًا في عالم جديد، مليان ابتكارات.'''
		reshaped_text = reshape(Khaial3)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label21.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class khaial4 (Screen):
	def on_enter(self):
		Khaial4 ='''العنوان (" البحث عن الكوكب المثالي ")

المهمة الجديدة :
في سنة 2070، قررت وكالة الفضاء إرسال بعثة
 للبحث عن كوكب صالح للعيش.
كان فيه رائد فضاء اسمه "رؤوف" جزء من البعثة.

الاستعدادات :
اجتمعوا في مركبتهم وبدأوا رحلتهم.
كانوا متحمسين لاكتشاف عوالم جديدة.
رؤوف كان متطلع جدًا للمغامرات.

الاكتشاف :
بعد شهور من السفر، اكتشفوا كوكب يشبه
 الأرض.
كان مليان مياه وخضرة، وبدأوا ينزلوا
 يستكشفوا.

المشاكل :
لكن، اكتشفوا إن الكوكب كان مليان مخلوقات
 غريبة.
المخلوقات دي كانت بتحاول تحمي بيئتها،
 وبدأوا يتعاملوا مع رائد الفضاء بحذر.

التفاوض :
رؤوف قرر إنه يتواصل مع المخلوقات.
استخدم التكنولوجيا اللي عنده لتوصيل
 رسالته، وقال لهم: "إحنا جينا نساعدكم، مش
  نهدمكم".

التفاهم :
المخلوقات بدأت تفهمهم.
رؤوف وفريقه بدأوا يتعاونوا مع الكائنات،
 واشتغلوا سوا للحفاظ على البيئة.

المشاركة :
مع الوقت، اكتشفوا إنهم ممكن يعيشوا سوا.
رؤوف وفريقه كانوا مبهورين بقدرات 
المخلوقات وبدأوا يتعلموا منهم.

البداية الجديدة :
بعد فترة، قرروا إنهم يرجعوا للأرض ويشاركوا
 الاكتشاف.
رؤوف حس إنهم عملوا صداقة جديدة مع الكائنات.

العودة :
لما رجعوا للأرض، كانوا محملين بالمعرفة
 الجديدة.
رؤوف عرف إن التعاون هو السبيل لبناء
 مستقبل أفضل.'''
		reshaped_text = reshape(Khaial4)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label22.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class khaial5 (Screen):
	def on_enter(self):
		Khaial5='''العنوان (" الفضائيون في المدينة ")

الزيارة المفاجئة :
في مدينة كبيرة، ظهرت سفينة فضائية في
 السماء.
الناس كانوا متعجبين، وبدأوا يخافوا.
كان فيه شاب اسمه "فهد" عايز يعرف الحقيقة.

الاقتراب :
فهد قرر إنه يروح يشوف السفينة.
لما وصل، اتفاجئ بشيء عجيب: كائنات
 فضائية نزلوا وبدأوا يتكلموا مع الناس.

التواصل :
فهد كان أول واحد يجرؤ ويكلم الفضائيين.
الكائنات كانوا لطيفين وبيضحكوا، وبدأوا
 يشرحوا إنهم جايين من كوكب بعيد عشان
  يتعرفوا على البشر.

المفاجأة :
الفضائيين عرضوا على الناس تقنيات جديدة
 تساعدهم في حياتهم.
كانوا عايزين ينقلوا المعرفة ويفيدوا
 البشرية، لكن في ناس كانوا خايفين
  ورافضين.

الصراع :
بدأت تظهر مجموعات في المدينة بتعارض
 وجود الفضائيين.
كانوا خايفين من تأثيرهم.
فهد حاول يقنع الناس إنهم مش خطر، 
لكن الوضع كان متوتر.

الاختبار :
الفضائيين قرروا يعملوا تجربة عشان يثبتوا
 حسن نيتهم.
اقترحوا إنهم يقدموا علاج لمرض شائع في
 المدينة.
الناس بدأوا يشكوا في الموضوع.

النجاح :
بعد التجربة، اتضح إن العلاج فعلاً شغال.
بدأت تتغير آراء الناس وبدوا يتقبلوا
 الفضائيين أكثر.
فهد كان سعيد لأنه كان جزء من التغيير.

التعاون :
فهد والفضائيين بدأوا يشتغلوا مع بعض.
كانوا بيحضروا ورش عمل لنقل المعرفة
 والتكنولوجيا للبشر.
بدأ التعاون بينهم وبين المدينة يتزايد.

التعايش :
في النهاية، الكائنات الفضائية أصبحوا جزء من
 المجتمع.
فهد حس إنه ساهم في تغيير الفكرة السلبية
 عنهم، وبدأوا يعيشوا في سلام وتعاون.'''
		reshaped_text = reshape(Khaial5)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label23.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class khaial6 (Screen):
	def on_enter(self):
		Khaial6='''العنوان (" الذكاء في عالم السحر ")

المدينة السحرية :
في عالم موازٍ، كانت فيه مدينة مليانة سحر،
 لكنهم كانوا متخلفين عن العالم التكنولوجي.
كان فيه شاب اسمه "رامي" عايز يدمج بين العلم
 والسحر.

البحث عن المعرفة :
رامي قرر إنه يسافر للمدينة القديمة عشان
 يدرس كتب السحر.
كان متحمس جدًا إنه يكتشف أسرار العالم.

الاختراعات السحرية :
لما رجع، بدأ يشتغل على اختراعات تجمع بين
 السحر والتكنولوجيا.
أول اختراع كان عبارة عن جهاز سحري يعمل
 بكهرباء سحرية.

التحدي :
لكن فيه سحرة عارضوا أفكاره.
قالوا إنه مش مسموح يجمعوا بين العلم 
والسحر.
رامي قرر إنه يثبت لهم إن السحر ممكن يكون له
 فوائد كبيرة.

الاختبار :
رامي ابتكر تجربة سحرية باستخدام الجهاز
 اللي عمله.
لما عرض التجربة، الكل اتفاجئ من النتائج.
بدأت الآراء تتغير عن دمج العلم بالسحر.

التعاون الجديد :
بعد التجربة الناجحة، بدأ السحرة يتقبلوا
 فكرة التعاون مع رامي.
اتفقوا على استخدام اختراعاته في تحسين
 الحياة اليومية في المدينة.

البداية الجديدة :
مع مرور الوقت، بدأت المدينة تتطور بفضل
 الدمج بين العلم والسحر.
رامي كان فخور جدًا بالنتائج.

توسيع الآفاق :
المدينة بدأت تستقطب زوار من أماكن تانية
 عشان يتعلموا عن دمج العلم بالسحر.
رامي أسس أكاديمية لتعليم الجميع.

الحلم تحقق :
في النهاية،
 رامي عرف إنه بنجاحه، مش بس غير المدينة، لكن
  خلق مستقبل جديد لكل العالم.
الكل بدأ يعيشوا في سلام وتعاون.'''
		reshaped_text = reshape(Khaial6)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label24.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class action1 (Screen):
	def on_enter(self):
		Action1 ='''العنوان (" العدو المجهول ")

 الإنذار :

كان "يوسف" ظابط شرطة شاب
معروف بشجاعته وذكائه.
بيشتغل في فرع المخابرات،
وطول عمره شغال بجد عشان يحمي بلده.
في يوم من الأيام،
وصل له تقرير سري عن جماعة إرهابية مجهولة
بتحضر لحاجة كبيرة جوه البلد.
لكن المشكلة إن مفيش أي تفاصيل،
ولا عن المكان ولا عن الهدف.
بس التقرير جايب رسالة واضحة:
"أنت مش هتعرف تكشفنا".

البحث عن الخيط :

قرر يوسف إنه مايسكتش
وابتدى يجمع فريق من أفضل الناس اللي
 يعرفهم.
الفريق كان فيه "ماهر" الخبير في الاختراق
 الإلكتروني،
و"سليم" اللي عنده مهارات تخفي عالية،
و"مريم" اللي مسؤولة عن المعلومات السرية.
بدأوا يحفروا في أي معلومة صغيرة
توصلهم للجماعة دي،
وابتدوا يراقبوا كل شخص ممكن يكون ليه
 علاقة.

الشكوك بتزيد :

في وسط البحث،
ماهر لقى إن فيه تحويلات مالية كبيرة
بتروح لمكان مجهول في القاهرة،
وده اللي خلاه يشك إن التحويلات دي
وراها الناس دي.
استغلوا معلوماتهم وعملوا خطة
لمراقبة المنطقة اللي بيتحول لها الفلوس.
وأخيرًا، يوسف لقى خيط،
لكن كان واضح إن الجماعة الإرهابية
عندها إمكانيات أعلى من المتوقع.

المواجهة الأولى :

بعد أيام من التحريات،
يوسف والفريق قرروا يقتحموا المكان اللي
 اكتشفوه،
لكن لما وصلوا، اتفاجئوا إنهم متراقبين هما
 كمان.
بدأ تبادل نيران عنيف،
وأدرك يوسف إن الجماعة عارفة كل خطوة
 بيعملوها،
كأن حد من جوه بيبلغهم.
لكن في النهاية،
قدر الفريق يهرب بعد ما فقدوا كاميراتهم.

 اكتشاف الخائن :

يوسف بدأ يشك إن فيه خيانة جوه فريقه.
ابتدى يراقب الكل،
وفي يوم، اكتشف إن "سليم"
كان بيتواصل سرًا مع حد غريب.
كان مصدوم لكن مكنش قدامه حل،
فقرر يواجه سليم.
اعترف له إنه مجبر
عشان الجماعة دي خطفت عيلته وبيهددوه،
واتفقوا إنهم يستغلوا المعلومات اللي عند
 سليم
عشان يدخلوا وسط الجماعة.

الاختراق:

سليم قرر يساعد الفريق،
فبدأ يقنع الجماعة إنه مستعد يشتغل معاهم،
وفعلاً بعتوه على اجتماع سري في مكان بعيد.
استخدموا معدات تجسس سرية
وسليم قدر يدخل ويسجل كل حاجة،
من ضمنها اسم الزعيم،
وهو راجل غامض اسمه "الظل"،
اللي محدش يعرف ملامحه.

الكمين :

بعد التسجيلات،
عرف يوسف إن الجماعة بتحضر لعملية كبيرة
في وسط العاصمة،
وقرر إنه هو وفريقه ينصبوا لهم كمين.
في يوم العملية،
الجماعة اتحركت لتنفيذ الخطة،
لكن يوسف والفريق كانوا في انتظارهم.
حصلت مواجهة شديدة،
والظروف كانت صعبة جدًا.

 مواجهة الظل :

يوسف كان مصمم إنه يقبض على "الظل"،
وفعلاً وصل له بعد مواجهة قوية.
لكنه اتفاجئ إن الظل كان بيخطط للهروب من
 زمان.
حاول يوسف يمسكه،
بس الظل كان مجهز خطته للهروب
واختفى قبل ما يوسف يقدر يقبض عليه،
وفضلت حكايته لغز.

النهاية :

بعد اللي حصل،
يوسف أدرك إن شغله لسه ما انتهاش،
وإن الحرب مع الأعداء الغير معروفين لسه
 مستمرة.
الجماعة اتفككت،
لكن زعيمها لسه حر،
ويوسف وفريقه قرروا يفضلوا مستعدين لكل
 الاحتمالات،
لأن الخطر ممكن يرجع في أي لحظة.'''
		   
		reshaped_text = reshape(Action1)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label13.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text		
class action2 (Screen):
	def on_enter(self):
		Action2 = '''العنوان ("سقوط الإمبراطورية")"

الظلم والاضطهاد :

في عالم خيالي بعيد،
حكمت إمبراطورية ظالمة بقيادة الإمبراطور
 رافين،
الذي استغل سلطته بشكل وحشي.

كانت البلاد غارقة في الفقر،
والشعب يعاني من قسوة الضرائب والتجويع.

في ظل هذه الظروف،
كانت هناك مجموعة من المتمردين
 الذين قرروا الوقوف في وجه الظلم.

من بينهم، كانت هناك محاربة شجاعة 
تُدعى ليلى.



التخطيط للتمرد :

اجتمعت ليلى مع رفاقها في أحد الكهوف النائية،
حيث خططوا للإطاحة بالإمبراطور.

كانت ليلى تمتلك مهارات قتالية استثنائية
 وذكاء حاد،
مما جعلها القائدة المثالية.

تم إعداد خطة محكمة لاستهداف القصور 
والمراكز الحيوية في العاصمة.


الهجوم الأول :

في ليلة مظلمة،
نفذ المتمردون الهجوم الأول.

دخلوا العاصمة بسرية،
مستهدفين المخازن التي تحتوي على المؤن
 والأسلحة.

بفضل مهارات ليلى في التخطيط والتنفيذ،
تمكنوا من نهب المخازن وتوزيع المؤن على
 الشعب،
مما أشعل روح المقاومة في قلوب الناس.


الانتقام من الأعداء :

بعد نجاح الهجوم الأول،
قرر رافين الانتقام من المتمردين.

أرسل فرقة من المحاربين المدربين لملاحقتهم
 والقضاء عليهم.

لكن ليلى وفريقها كانوا مستعدين،
وتمكنوا من صد الهجوم في معركة ملحمية.

خلال المعركة، أصيبت ليلى بجروح،
لكنها استمرت في القتال،
مما زاد من إلهام المتمردين.


الكشف عن الأسرار :

مع تقدم المقاومة،
بدأت ليلى في اكتشاف أسرار خطيرة عن
 الإمبراطور رافين.

اكتشفت أنه كان يتعاون مع كائنات سحرية
لتحصيل القوة والسيطرة على البلاد.

كانت هذه المعلومات تُعتبر سلاحًا قويًا في يد
 المتمردين.


 المعركة النهائية :

مع وصول المقاومة إلى ذروتها،
قررت ليلى ورفاقها الهجوم على القلعة التي
 يتواجد فيها رافين.

كانت المعركة ضارية،
حيث استخدمت كل قوة ومهارات ممكنة.

بعد مواجهة عنيفة،
واجهت ليلى رافين شخصيًا في قتال قاسي.



النهاية :

في النهاية، استطاعت ليلى القضاء على
 رافين،
مما أدى إلى سقوط الإمبراطورية الظالمة.

عاد السلام إلى البلاد،
وأصبحت ليلى رمزًا للأمل والشجاعة،
بينما بدأ الشعب في إعادة بناء حياتهم من
 جديد.'''
		   
		reshaped_text = reshape(Action2)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label14.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class action3 (Screen):
	def on_enter(self):
		Action3 ='''العنوان ("سرقة الألماس")"


 الخطة المحكَّمة :

في مدينة مليئة بالجرائم،
كان هناك لص بارع يُدعى كريم.

عُرف عنه أنه محترف في سرقة الألماس
 والمجوهرات.

عندما سمع عن وجود ألماسة نادرة تُعرف باسم
 "نجمة الليل" في أحد المتاحف،
قرر أن تكون تلك هي سرقته القادمة.


جمع الفريق :

قبل تنفيذ خطته،
قرر كريم جمع فريقه المكون من ثلاثة لصوص
 محترفين:

سامي، خبير التكنولوجيا؛

وميلي، مُتخصصة في التخفي؛

ونادر، الذي يعرف كل تفاصيل المتحف.

اجتمعوا لوضع خطة معقدة.


تنفيذ السرقة :

في الليلة المحددة،
ارتدى الفريق أزياء تخفي ونجحوا في تجاوز
 الحراس باستخدام التكنولوجيا الحديثة.

بينما كان سامي يراقب الكاميرات،
استخدمت ميلي مهاراتها في التنكر لتجاوز
 الحراس.

وعندما وصلوا إلى الغرفة التي تحتوي على
 الألماسة،
اكتشفوا أنها محمية بنظام أمان متطور.


المفاجأة :

لكن بينما كانوا يحاولون تعطيل النظام،
انفجرت الأضواء وكُشف أمرهم.

كان هناك حارس خفي في المتحف.

دارت مطاردة مثيرة في أنحاء المتحف،
حيث استخدم الفريق كل مهاراتهم للهروب.


المواجهة النهائية :

بعد صراع طويل،
واجهوا الحارس في غرفة الألماسات.

استخدم كريم كل مهاراته في القتال ليواجه
 الحارس،
بينما كان نادر يسرع لاستعادة الألماسة.

في نهاية المعركة،
تمكن الفريق من الهرب بالألماسة بفضل
 تنسيقهم المثالي.


النهاية :

بعد نجاحهم في السرقة،
أدركوا أن الألماسة تجلب الخطر.

قرروا إعادتها إلى المتحف بطريقة مثيرة،
حيث أرسلوا رسالة للأمن بأن الألماسة كانت
 مخبأة في مكان ما.

أثار هذا الجدل في المدينة وخلّف وراءه أسئلة
 حول هوية اللصوص،
لكنهم اختفوا في الظل.'''
		   
		reshaped_text = reshape(Action3)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label15.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class action4 (Screen):
	def on_enter(self):
		Action4 ='''العنوان ("قوة السيف الأسطوري")"



الأسطورة القديمة :

في زمن بعيد،
كان هناك سيف أسطوري يُعتقد أنه يمتلك قوة
 خارقة.

يُقال إنه يمكنه هزيمة أي عدو يحمل الشر في
 قلبه.

سمع عن هذا السيف العديد من المحاربين،
لكن لم يتمكن أحد من العثور عليه.


رحلة البحث :

كان هناك محارب شاب يُدعى زيد،
وقد قرر أن يبحث عن السيف.

بعد أن فقد عائلته بسبب مملكة ظالمة،
كان عزيمته قوية.

بدأ رحلته في جبال خطيرة وغابات كثيفة،
مستعينًا بحكماء في القرى.


المعارك والمواجهات :

واجه زيد العديد من المخلوقات الشريرة
 والعقبات خلال رحلته.

في إحدى المعارك،
واجه تنينًا كبيرًا.

استخدم ذكاءه وشجاعته لهزيمة التنين،
مما زاد من سمعته كأحد الأبطال.



اكتشاف السيف :

بعد الكثير من التحديات،
اكتشف زيد مدخلًا غامضًا يؤدي إلى كهف قديم.

هناك، وجد السيف الأسطوري موضوعًا على قاعدة
 حجرية.

لكن عند لمسه،
شعر بقوة كبيرة تتدفق فيه، وأدرك أن عليه
 استخدام هذه القوة بحكمة.


المواجهة النهائية :

عند عودته إلى قريته،
وجد أن المملكة الظالمة تستعد لشن هجوم.

قرر استخدام السيف لمواجهة الحاكم الشرير.

كانت المعركة حاسمة،
حيث استخدم زيد كل قوته ومهاراته في القتال.


النهاية :

تمكن زيد من هزيمة الحاكم،
وأعاد السلام إلى مملكته.

أصبح زيد رمزًا للأمل والشجاعة،
وأصبح السيف في حوزته رمزًا للحق.'''
		   
		reshaped_text = reshape(Action4)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label16.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class action5 (Screen):
	def on_enter(self):
		Action5 ='''العنوان (" الباحثون عن الحقيقة")


الغموض :

كان هناك مجموعة من الصحفيين الشباب
 يحققون في سلسلة من الجرائم الغامضة التي
  تحدث في المدينة.
قرروا تشكيل فريق للبحث عن الحقيقة وكشف
 النقاب عن الفساد الموجود في السلطات.


بداية التحقيق :

بدأ الفريق بالبحث عن المعلومات،
حيث تواصلوا مع الشهود وجمعوا الأدلة.
لكن مع تقدمهم، بدأت تهديدات تصل إليهم من
 شخصيات مشبوهة،
تحذرهم من الاستمرار في التحقيق.


ملاحقة الأعداء :

بعدما تلقوا تهديدات،
تعرض الفريق لمطاردة من قبل رجال الأمن
 الفاسدين الذين كانوا متورطين في الجرائم.
بدأت مطاردات مثيرة حيث استخدموا سياراتهم
 في شوارع المدينة.


كشف الفساد :

تمكن الفريق من تجميع الأدلة اللازمة ضد
 المسؤولين الفاسدين.
وفي مؤتمر صحفي، أعلنوا عن كل ما وجدوه،
مما أثار ردود فعل كبيرة من الجمهور.


النهاية :

تم القبض على الفاسدين،
وعادت الثقة إلى المدينة.
أصبح الفريق رمزًا للحق،
وقرروا الاستمرار في كشف الفساد ومحاربة
 الظلم.'''
		   
		reshaped_text = reshape(Action5)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label17.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class action6 (Screen):
	def on_enter(self):
		Action6 = '''العنوان ("الكائنات المحاربة")"


 هجوم الوحوش :

في مدينة معزولة،
تعرض السكان لهجوم من كائنات غريبة ومخيفة.
لم يكن لديهم فكرة عن مصدر هذه الكائنات أو
 كيفية التصدي لها.
كان الأمل يتلاشى،
لكن شابًا يُدعى رامي قرر أن يتصدى لهذا التهديد


التجهيز للمعركة :

جمع رامي مجموعة من المحاربين،
حيث بدأوا في التدريب على أساليب القتال
 ووسائل الدفاع عن النفس.
استخدموا كل الوسائل المتاحة لهم لتطوير
 مهاراتهم.


المعركة ضد الوحوش :

بعد أسابيع من التدريب،
بدأوا في مواجهة الكائنات.
كانت المعارك عنيفة،
حيث استخدم رامي ورفاقه كل 
ما لديهم من قوة وشجاعة.


 اكتشاف السر :

خلال المعارك،
اكتشف رامي أن الكائنات كانت تحت سيطرة
 ساحر شرير.
قرر مواجهة الساحر وإيقافه قبل أن يتسبب في
 مزيد من الدمار.


النهاية :

في النهاية،
تمكن رامي من هزيمة الساحر وتحرير المدينة من الكائنات الشريرة.
أعاد السلام إلى المدينة،
وأصبح بطلًا يُحتذى به في جميع أنحاء البلاد'''
		   
		reshaped_text = reshape(Action6)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label18.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text		
class aljas1 (Screen):
	def on_enter(self):
		Aljas1 ='''العنوان: "لغز كوكب الزهرة"

الاكتشاف:
في سنة 1962، أرسلت وكالة ناسا مركبة
 فضائية اسمها "مارينر 2" للكوكب الزهرة.
الاكتشافات الأولية أظهرت إن الكوكب له غلاف
 جوي كثيف ودرجات حرارة مرتفعة.

الأسئلة العديدة:
لكن الغريب إن الصور اللي اتاخدت من الكوكب
 كانت غير واضحة.
العلماء بدوا يتساءلوا: ليه الكوكب مغطى
 بسحب كثيفة؟ وهل فيه حياة هناك؟

التحليلات المتناقضة:
بعض العلماء اعتقدوا إن الزهرة ممكن يكون فيه
 نشاط بركاني بسبب حرارة سطحه.
لكن فرضيات تانية قالت إن الظروف هناك مش
 ملائمة للحياة.

تغيرات المناخ:
مع مرور السنين، بدأت الدراسات توضح إن الزهرة
 كان فيها محيطات من الماء،
لكن بسبب تأثير غازات الدفيئة، تحولت
 لبيئة قاسية.

الإشارات الغامضة:
في 1978، اكتشف العلماء إشارات غامضة من
 الزهرة، مما زاد الغموض حول الكوكب.
كانت الإشارات عبارة عن ترددات غريبة.

المهمات المستمرة:
توالت المهمات بعد كده، وكل واحدة كانت بتحاول
 تحل اللغز.
لكن كل ما يكتشفوا حاجة جديدة، كل ما يزداد
 اللغز تعقيدًا.

التفسير النهائي؟
بعد عدة سنوات من البحث، اقترح بعض العلماء
 إن الزهرة ممكن تكون مكانًا مناسبًا للحياة في
  السابق.
لكن ما زال اللغز قائمًا.

الآمال الجديدة:
في الفترة الأخيرة، بدأت بعض البعثات تهدف
 لدراسة الغلاف الجوي للزهرة بشكل أعمق.
العلماء متفائلين إنهم ممكن يكتشفوا أسرار
 جديدة.

التحدي المستمر:
اللغز مازال مفتوحًا، والبحث عن إجابات مستمر.
هل سنكتشف يومًا ما السر وراء كوكب الزهرة؟
 الوقت وحده هو اللي هيكشف لنا الإجابة.'''
		reshaped_text = reshape(Aljas1)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label25.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text											
class aljas2 (Screen):
	def on_enter(self):
		Aljas2 ='''العنوان: "لغز مثلث برمودا"

البداية الغامضة:
مثلث برمودا هو منطقة مشهورة في المحيط
 الأطلسي بين فلوريدا وبورتو ريكو.
فيه تقارير كثيرة عن سفن وطائرات اختفت
 بشكل غامض.

الحوادث الكثيرة:
منذ قرون، اختفت العديد من السفن في هذه
 المنطقة.
بعض الناس قالوا إن السبب هو العواصف
 الشديدة، لكن البعض الآخر كان لديه تفسيرات
  غريبة.

المزاعم الغريبة:
بعض النظريات اقترحت إن فيه كائنات
 فضائية ممكن تكون السبب وراء هذه
  الاختفاءات.
لكن هذه النظرية ما كانتش مقبولة علميًا.

البحث العلمي:
على مر السنين، حاول علماء البحار تحليل
 الحوادث، لكن ما لقوا تفسير واضح.
كان فيه تقارير عن تيارات بحرية قوية ونقص
 في الخرائط.

الأدلة المتناقضة:
في فترة معينة، استمرت حوادث الاختفاء، لكن
 بعد كده بدأت الأعداد تقل.
العلماء بدؤوا يتساءلوا: هل كانت مجرد صدفة؟

التكنولوجيا الحديثة:
مع تقدم التكنولوجيا، بدأت الفرق البحثية
 باستخدام طائرات بدون طيار وأجهزة حديثة
  لتتبع ما يحدث في المنطقة.
لكنهم لم يجدوا أدلة جديدة.

التحقيقات المستمرة:
استمرت التحقيقات، وكلما تم اكتشاف شيء
 جديد، زادت الحيرة.
هل كل هذه الحوادث مجرد شائعات أم إنها
 حقيقة؟

الأساطير والتقاليد:
المشكلة إن الناس في بعض الأحيان يميلوا
 لتصديق الأساطير أكثر من الحقائق العلمية.
هذا زاد من الغموض حول المنطقة.

البحث عن الحقيقة:
حتى الآن، مثلث برمودا ما زال يمثل لغزًا.
العلماء متأكدين إنهم قريبين من الحل، لكن ما
 زالوا بحاجة لمزيد من البحث.'''
		reshaped_text = reshape(Aljas2)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label26.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class aljas3 (Screen):
	def on_enter(self):
		Aljas3 ='''إليك القصة بالشكل المطلوب:

العنوان: "لغز شجرة الحياة"

البداية:
في علم الأحياء، شجرة الحياة تمثل كل
 الكائنات الحية.
لكن العلماء لسه مش قادرين يحددوا كيف
 تطورت كل هذه الكائنات.

السجل الأحفوري:
التاريخ الأحفوري يعطي نظرة على التطور، لكن
 السجل الأحفوري ناقص.
فيه كائنات اختفت، وما عندناش أدلة كافية عن
 بعضها.

التحديات:
العلماء واجهوا تحديات في تحديد تسلسل
 تطور الكائنات.
فيه كائنات تشبه بعضها، لكن كيف اتطورت؟
 دي كانت علامة استفهام كبيرة.

التقنيات الحديثة:
مع التقدم التكنولوجي، بدأ العلماء يستخدموا
 تسلسل الحمض النووي لتحديد العلاقات بين
  الكائنات.
لكن كانت النتائج متناقضة أحيانًا.

الأدلة الغائبة:
رغم كل الأبحاث، لا زال بعض العلماء 
يشكون في بعض الفرضيات.
ليه فيه كائنات تطورت بشكل مختلف في
 بيئات متشابهة؟

نظرية التطور:
نظرية داروين للتطور كانت أساس العلم، لكن
 في بعض الناس بدؤوا يتساءلوا:
هل كل الكائنات تطورت من سلف واحد؟

الحياة في الفضاء:
بعض العلماء بدأوا يتساءلوا: هل يمكن وجود
 أشكال حياة أخرى في الفضاء وكيف تتفاعل مع
  الحياة على الأرض؟
كل ده زاد اللغز تعقيدًا.

تطوير الأبحاث:
تواصل البحث واستخدام تقنيات حديثة لفهم
 الحياة وتاريخها.
لكن كل ما اكتشفوا حاجة جديدة، كل ما زاد
 الغموض.

الأسئلة المفتوحة:
شجرة الحياة لا تزال مليئة بالألغاز.
هل سنكتشف يومًا ما كيف نشأت الحياة؟ الوقت
 هو اللي هيجاوب على السؤال ده.'''
		reshaped_text = reshape(Aljas3)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label27.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class aljas4 (Screen):
	def on_enter(self):
		Aljas4 ='''إليك القصة بالشكل المطلوب:

العنوان: "لغز الأهرامات"

العمارة العظيمة:
الأهرامات في مصر واحدة من أعظم المعالم على
 وجه الأرض.
العلماء لا يزالوا مش متأكدين عن كيفية بنائها
 وسبب ذلك.

الأسرار القديمة:
في بداية الأبحاث، قالوا إن الأهرامات اتبنت
 باستخدام الحجارة الضخمة.
لكن كيف تم نقلها وتشكيلها بهذه الدقة؟ دي
 كانت علامات استفهام.

التقنيات القديمة:
بعض الباحثين اقترحوا إن المصريين القدماء
 استخدموا تقنيات متقدمة لنقل الحجارة،
لكنهم لسه مش قادرين يثبتوا ذلك.

النظريات المتعددة:
فيه نظريات كتير حول كيفية بناء الأهرامات،
 من استخدام العربات إلى الرافعات.
لكن ما فيش إجابة واحدة مرضية.

الرمزية والأغراض:
البعض اعتبر الأهرامات مقابر ملكية، وآخرين
 اعتبروها معابد.
السؤال: ليه تم اختيار هذا الشكل والمعمار؟

الاستكشافات الحديثة:
مع تقنيات الليزر والأنظمة الحديثة، بدأ
 الباحثون في دراسة الأهرامات بشكل أعمق.
لكن ما زالت بعض الأسرار غامضة.

الأبحاث الأثرية:
مع كل الاكتشافات الجديدة، كان في مجال
 للبحث عن المزيد.
لكن كل ما تم اكتشافه، زاد اللغز تعقيدًا.

الأسئلة المعلقة:
هل كانت الأهرامات مرتبطة بنظام ديني أو
 سياسي؟
هل كانت هناك تكنولوجيا سرية وراء بناءها؟
 الأسئلة لسه مفتوحة.

التراث واللغز:
الأهرامات ستظل رمزًا للحضارة المصرية،
لكن اللغز وراءها سيظل يحيط بها. العلماء
 مستمرين في البحث، والجواب لسه مش واضح.'''
		reshaped_text = reshape(Aljas4)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label28.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text	
class aljas5 (Screen):
	def on_enter(self):
		Aljas5 ='''العنوان: "لغز الأوكيناوا"

 الجزيرة الغامضة :
أوكيناوا في اليابان مشهورة بتنوع ثقافتها
 وطبيعتها.
لكن هناك لغز غريب حول سر طول عمر سكانها.

السكان الطوال العمر :
الباحثون اكتشفوا إن نسبة كبيرة من سكان
 أوكيناوا عايشين فوق الـ100 سنة.
كل الناس اتسألت: إيه السر ورا طول العمر ده؟

نمط الحياة :
العلماء بدأوا يدرسون عاداتهم الغذائية ونمط
 حياتهم.
اكتشفوا إنهم بيأكلوا خضروات وفواكه بكثرة
 ويمارسوا الرياضة.

  الوراثة :
لكن السؤال لسه قائم: هل الوراثة ليها دور في
 طول العمر؟
بعض الأبحاث اقترحت إن في جينات معينة
 ممكن تكون مسؤولة عن طول عمر السكان، لكن
  لسه مفيش إجابات قاطعة.

التفاعل الاجتماعي :
علماء النفس قالوا إن التفاعل الاجتماعي
 والروابط القوية بين السكان بيلعبوا دور مهم
  في صحتهم النفسية والجسدية.
هل هو السر ورا طول عمرهم؟

الممارسات الروحية :
سكان أوكيناوا معروفين بتقاليدهم الروحية،
 وبيمارسوا التأمل.
بعض الأبحاث ربطت بين الممارسات الروحية
 والطول العمر.

 الضغوط النفسية :
الضغط النفسي معروف إنه ممكن يؤثر سلبًا
 على الصحة.
في أوكيناوا، الحياة بتميل تكون أقل توترًا، هل
 هو ده السبب؟

البحوث المستمرة :
الأبحاث حول طول عمر سكان أوكيناوا مستمرة،
 ومع كل اكتشاف جديد، بيزيد اللغز تعقيدًا.
هل سنجد يومًا ما الإجابة النهائية؟

السر المفقود :
في النهاية، يبقى سر طول عمر سكان أوكيناوا
 مجهولًا.
كل ما اكتشفوا تفاصيل جديدة، زاد فضول
 العلماء.
هيظل اللغز مفتوح.'''
		reshaped_text = reshape(Aljas5)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label29.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text													
class aljas6 (Screen):
	def on_enter(self):
		Aljas6 ='''العنوان: "لغز تفجير هيروشيما"

الكارثة الكبرى:
في 6 أغسطس 1945،
 تم إلقاء القنبلة النووية على مدينة
  هيروشيما في اليابان.
الحادث كان له تأثيرات ضخمة، لكن اللغز بدأ
 بعد الكارثة.

الأدلة الغامضة:
بعد التفجير، بدأ العلماء يدرسوا تأثيرات
 الإشعاع على الصحة.
لكن بعضهم اكتشف أدلة غريبة، مثل تأثيرات
 غير معتادة على بعض الأشخاص.

التغيرات الجينية:
علماء الأحياء بدأوا يلاحظوا تغيرات جينية في
 بعض الناجين.
السؤال: هل كانت الإشعاعات هي السبب ورا
 التغيرات دي؟

الأمراض الجديدة:
بعض الناجين طوروا أمراض نادرة وغير معروفة
 بعد التفجير.
العلماء بدأوا يتساءلوا: هل فيه علاقة بين
 الأمراض والإشعاعات؟

التحليلات النفسية:
التأثير النفسي كان كبير، وبدأت تظهر حالات
 من اضطراب ما بعد الصدمة.
العلماء بدأوا يدرسون كيف تأثرت نفسية
 الناجين.

نظريات المؤامرة:
ظهرت نظريات مختلفة حول التفجير، من
 ادعاءات بتجارب سرية إلى تدخلات حكومية.
لكن معظم النظريات كانت غير مدعومة بأدلة
 قوية.

الأبحاث المستمرة:
التحقيقات مستمرة، والبحث عن الحقيقة لا
 يزال مفتوح.
كلما اكتشفوا حاجة جديدة، زادت الأسئلة.

التأثيرات المستقبلية:
الأبحاث بتستمر لفهم التأثيرات بعيدة
 المدى على الصحة.
هل فيه مخاطر ممكن تظهر بعد مرور سنوات؟

الذكرى الحية:
بالرغم من كل الألغاز، يبقى تفجير هيروشيما
 ذكرى مؤلمة.
العلم مستمر في البحث عن الإجابات، لكن
 بعض الأسرار قد تظل مخفية للأبد.'''
		reshaped_text = reshape(Aljas6)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label30.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text										
class papy1 (Screen):
	def on_enter(self):
		Papy1='''العنوان ("الأرنب والسلحفاة")


التحدي الكبير:
في يوم من الأيام، كان فيه أرنب و سلحفاة
 عايشين في غابة جميلة.
الأرنب كان مغرور ودايمًا بيقول إنه أسرع حيوان
 في الغابة.


منافسة:
السلحفاة، اللي كانت هادئة وبتحب المنافسة،
 قررت تتحداه في سباق.
الأرنب ضحك وقال:
 "سباق؟ أنتِ هتخسري حتمًا!"


يوم السباق:
حددوا يوم السباق، وبدأوا يجمعوا الحيوانات في
 الغابة علشان يتفرجوا.
الكل كان متشوق يشوف مين هيفوز.


انطلاق السباق:
بمجرد ما انطلق السباق، الأرنب جري بسرعة
 كبيرة.
السلحفاة كانت بتمشي ببطء، لكن كان عندها
 خطة.


استراحة الأرنب:
الأرنب كان مغرور وقرر ياخد استراحة
 تحت شجرة.
قال لنفسه: "عندي وقت كتير، مش محتاج
 أستعجل."


السلحفاة تستمر:
بينما الأرنب نائم، السلحفاة استمرت في
 المشي ببطء وثبات.
الكل كان متشجع ليها.


استيقاظ الأرنب:
بعد فترة، استيقظ الأرنب لقى إن السلحفاة
 خلاص قربت من خط النهاية.
جري بسرعة، لكن كان الوقت متأخر.


الفوز المفاجئ:
السلحفاة وصلت خط النهاية أولًا، وكل
 الحيوانات صاحت بفرح.
الأرنب كان متفاجئ وخجل من نفسه.


الدرس المستفاد:
الأرنب اتعلم درس مهم: "لا تستخف بأحد، كل
 واحد عنده ميزاته."
ومن يومها، بطل يتعالى على الآخرين.'''
		reshaped_text = reshape(Papy1)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label31.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class papy2 (Screen):
	def on_enter(self):
		Papy2='''العنوان ("النجمة الصغيرة")


في السماء:
كان فيه نجمة صغيرة عايشة في السماء.
كانت بتحلم تكون نجمة كبيرة وتكون مرئية
 لكل الناس.


الأمنيات:
كل ليلة، كانت تنظر للأرض وتتمنى إن الناس
 يشوفوها.
لكن كانت دايمًا صغيرة جدًا.


اللقاء مع السحاب:
في يوم من الأيام، اتقابلت مع سحابة كبيرة.
السحابة قالت لها: "ليه مش تذهبي للأرض؟"


فكرة جديدة:
النجمة الصغيرة فرحت بالفكرة وقررت تنزل
 للأرض.
سحابة أخدتها في رحلتها.


الوصول للأرض:
لما وصلت للأرض، لقيت أطفال بيلعبوا في
 الحديقة.
قررت تلمع بريقها عشان يشوفوها.


الدهشة:
الأطفال اتعجبوا من اللمعة الجميلة وبدأوا
 يرقصوا.
النجمة كانت فرحانة جدًا.


العودة للسماء:
لكن بعد فترة، نجمتها بدأت تضعف.
عرفت إنه لازم ترجع للسماء.


الوداع:
ودعت الأطفال وقالت لهم: "أنا هبقى دايمًا معاكم
 في السماء."
وعدتهم إنها هتلمع في الليل.


الأمل:
الأطفال كانوا مبسوطين جدًا وعادوا يناموا تحت
 ضوء النجوم،
وكل واحد منهم بقى يحلم بوقت جديد يشوف
 النجمة الصغيرة.'''
		reshaped_text = reshape(Papy2)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label32.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text	
class papy3 (Screen):
	def on_enter(self):
		Papy3='''العنوان ("الدب الصغير")


الدب في الغابة:
في غابة بعيدة، كان فيه دب صغير اسمه
 "توتو".
توتو كان يحب المغامرات وكان عنده فضول
 كبير.


الرحلة:
في يوم من الأيام، 
قرر توتو إنه يكتشف الغابة لوحده.
قال لأمه: "أنا هخرج أستكشف."


اللقاء مع الأصدقاء:
أثناء رحلته، لقى أرنب و سناجب.
قالوا له: "تعالى نلعب سوا." توتو كان مبسوط
 جدًا.


اللعبة الجديدة:
لعبوا مع بعض لعبة "اختبئ وابحث".
توتو كان متحمس وبدأ يدور على أصدقائه.


فقدان الاتجاه:
لكن وهو بيلعب، بدأ يتوه.
ما عرفش يرجع للطريق. خاف شوية وبدأ ينادي:
 "ماما، أين أنتي؟"


مساعدة الأصدقاء:
الأصدقاء سمعوه وجاووا عشان يساعدوه.
قال الأرنب: "ما تخافش، إحنا معاك."


البحث عن الطريق:
بدأوا كلهم مع بعض يدوروا على الطريق.
اتعاونوا مع بعض وكانوا بيحكوا قصص لطيفة
 عشان يشيلوا عنه الخوف.


العودة للمنزل:
بعد شوية، قدروا يلاقوا الطريق ويرجعوا تاني
 للمنزل.
توتو كان فرحان لأنه ما كانش لوحده.


الدرس المهم:
لما رجع توتو، قال لأمه:
 "التعاون مع الأصدقاء هو أهم حاجة."
وفعلاً، ما كانش في أحلى من الأصدقاء.'''
		reshaped_text = reshape(Papy3)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label33.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class papy4 (Screen):
	def on_enter(self):
		Papy4='''العنوان ("الألوان السحرية")

في قرية الألوان:
كان فيه قرية جميلة مليانة ألوان.
كل شيء فيها كان ملوّن، من البيوت للحدائق.


الرسام العجوز:
في القرية، كان فيه رسام عجوز اسمه "علي".
كان معروف بأنه يرسم أجمل اللوحات.


الكنز المخفي:
في يوم من الأيام، سمع الأطفال عن كنز مخفي.
كانوا عايزين يكتشفوا الكنز ده.


البحث عن الكنز:
قرروا يتعاونوا مع بعض ويبحثوا في الغابة.
كانوا بيدوروا في كل مكان.


العثور على الخريطة:
فجأة، لقوا خريطة قديمة تحت شجرة كبيرة.
الخريطة كانت مكتوبة بألوان غريبة.


المغامرة:
الأطفال اتبعوا الخريطة ورحلتهم كانت مليانة
 مغامرات.
كانوا بيواجهوا تحديات ويتعلموا مع بعض.


الكنز السحري:
في النهاية، وصلوا لمكان الكنز.
لكن لما فتحوا الصندوق، لقوا ألوان سحرية.


السعادة:
الألوان كانت تقدر تغير كل شيء في القرية.
الأطفال استخدموا الألوان الجديدة ورسموا
 لوحات جميلة.


العبرة:
علي قال لهم: "الألوان السحرية مش بس جمالية،
 لكنها بتعبر عن المشاعر."
من يومها، القرية بقت أكثر بهجة.'''
		reshaped_text = reshape(Papy4)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label34.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class papy5 (Screen):
	def on_enter(self):
		Papy5='''العنوان ("السمكة الذهبية")

في البحر:
في أعماق البحر، كانت فيه سمكة ذهبية جميلة.
كانت معروفة بجمالها وسط الأسماك.


الأماني:
في يوم من الأيام، قابلت السمكة صياد.
الصياد اتمنى أن السمكة تحقق له 3 أماني.


الأمنية الأولى:
الصياد قال: "أريد بيتًا كبيرًا."
السمكة لمعت، وفجأة، ظهر له بيت رائع على
 الشاطئ.
 

الأمنية الثانية:
الصياد كان فرحان جدًا، فكر في الأمنية الثانية.
قال: "أريد مركب جميل."
السمكة حققت له الأمنية.


الأمنية الأخيرة:
لكن لما جاء دور الأمنية الأخيرة، الصياد قال:
"أريد أن أصبح أغنى إنسان في القرية."
السمكة توقفت.


التحذير:
السمكة قالت له: "كل أمنية لها ثمن.
الأغنياء دائمًا في قلق."
لكن الصياد ما سمعش الكلام.


الثمن المدفوع:
بعد ما حققت له الأمنية، بدأ الصياد يشعر
 بالوحدة.
كل أصدقائه بعدوا عنه، لأنه أصبح مغرور.


الندم:
الصياد شعر بالندم وقرر يرجع 
للسمكة ويعتذر.
قال:
 "أنا آسف، كل ما كنت محتاجه هو الأصدقاء."


الدرس المستفاد:
السمكة قالت له: "الحب والصداقة هما أغلى من
 الذهب."
وبكده، رجع الصياد لحياته البسيطة وعاش
 سعيد.'''
		reshaped_text = reshape(Papy5)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label35.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class papy6 (Screen):
	def on_enter(self):
		Papy6='''العنوان: "الدودة الطموحة"

في الحديقة :
في حديقة جميلة،
 كانت فيه دودة اسمها "دودي".
دودي كانت طموحة وبتحب الحلم.

الطموح :
كانت بتتمنى تكون فراشة.
كل يوم، كانت تشوف الفراشات الجميلة وهي
 بتطير.

الأحلام :
كانت دودي بتحلم إنها تطير زي الفراشات.
كل ما تشوفهم، قلبها كان ينفجر من الفرح.

نصيحة الجدة :
قابلت دودي جدتها الدودة العجوز، قالت لها:
"الصبر هو مفتاح كل شيء.
انتظري شوية، هتتحققي حلمك."

التحضير للتغيير :
دودي قررت تنتظر وتكون صبورة.
بدأت تجهز نفسها، وبتأمل في الفراشات وهي
 بتطير.

الشرنقة :
بعد فترة، بدأت دودي تحس بالتغيير.
لقيت نفسها بتدخل في شرنقة.
في البداية، كانت خايفة، لكن تذكرت نصيحة
 جدتها.

الصبر في الشرنقة :
داخل الشرنقة، قضت دودي وقت طويل، وهي
 بتفكر في حلمها.
استمرت تفكر في الفراشات وكيف إنهم كانوا
 في نفس موقفها.

التحول السحري :
بعد فترة، حسّت دودي بشيء غريب، وقررت إنها
 تخرج من الشرنقة.
لما خرجت، اكتشفت إنها بقت فراشة جميلة!

التحليق في السماء :
فراشة دودي بدأت تطير وتستمتع بالحرية.
كل الفراشات استقبلوها وأشادوا بجمالها.
دودي فهمت إن الأحلام ممكن تتحقق بالصبر
 والعزيمة.'''
		reshaped_text = reshape(Papy6)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label36.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
class kalam(Screen):
	def on_enter(self):
		Kalam=''' بصي انا عارف اني مزعلك تمام .
بس عايزك تحطي في بالك ان دي اول مره اكلم
فيها بنت ف انا معتبرك واحد صاحبي فهمه.
وبعدين انا مش بعرف اقول كلام حلو تمام.
بس الي متاكد منه ان دي اول مره ارتاح لحد
 كده
و ممكن ده يكون احسن قرار اخده من فتره
 كبيره.
و انا متاكد ان حتي لو وصل الزعل الي انك
تعمليلي بلوك ف انا متاكد انك هترجعي او ان انا
هرجع لان احنا اخوات فهمه مفيش اخوات 
بيبعده عن بعض لان ملهمش غير بغض .
وانا اسف لو مزعلك حاليا او زعلتك بس بجد
انتي واحده من احسن الشخصيات الي قبلتها 
و انا متاكد ان هيجي يوم و هقبلك وش لوش
 مش بس شات.
و اوعدك لو وقعت ع وشي و اتغبيت و اتجوزت 
في يوم هتكوني اول المعزومين.
و اكيد انتي كمان هتعملي كده خلصه .
يا ستي لو مش عجبك التطبيق ف اعتبري
التطبيق اداه علشان اوصلك الرساله دي.
و حتي لو محصلش نصيب و ان احنا الاتنين مش
من نفس الديانه بس مش مشكله كل واحد اكيد
فاهم حياته و عارف ديانته و مفيش مشكله 
هنفضل برضه اخوات و ياما ناس مش من نفس 
الديانه و كانوا اخوات اكتر من الي في نفس
الديانه ف عادي هتفضلي اختي.
اخيرا شكرا علي الايام الحلوه الي كنا فيها مع
بعض ، و الجاي احسن ان شاء الله .
اسف اني طولت و شكرا يا احسن اخت.'''
		reshaped_text = reshape(Kalam)
		bidi_text = get_display(reshaped_text)
		self.ids.story_label37.text = bidi_text
	def on_pre_enter(self):
		self.ids.button.text = self.	get_arabic_text("ارجعي من هنا")
	def get_arabic_text(self, text):
	       reshaped_text = arabic_reshaper.reshape(text)  # إعادة تشكيل النص
	       bidi_text = get_display(reshaped_text)
	       return bidi_text
			
class MyApp(App):
    def build(self):
        return Builder.load_file('mydesign.kv')

if __name__ == "__main__":
    MyApp().run()